kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
#ifndef VND_DC_SAVE_ERASE_ENABLE
#define VND_DC_SAVE_ERASE_ENABLE 1u
#endif

#ifndef VND_DC_SAVE_ERASE_ONLY_TEST
#define VND_DC_SAVE_ERASE_ONLY_TEST 0u
#endif

static int16_t  vnd_dc_buf[2][2][VND_DC_ROI_LEN];
static uint8_t  vnd_dc_pos[2][2];
static uint8_t  vnd_dc_loaded = 0;
static uint8_t  vnd_dc_dirty = 0;
static uint32_t vnd_dc_write_counter = 0;
static uint32_t vnd_dc_flash_next_off = 0;
static uint32_t vnd_dc_last_save_ms = 0;
static uint32_t vnd_dc_last_dirty_log_ms = 0;
static volatile uint8_t vnd_dc_load_request = 0;
static volatile uint8_t vnd_dc_save_request = 0;
static uint32_t vnd_dc_last_adapt_ms[2][2];
static uint32_t vnd_dc_sar_budget_q16[2][2];

static volatile uint8_t  vnd_dc_mode = VND_DC_MODE_BOOT_FAST;
/* Режим, в который возвращаемся после FREEZE по команде SET_DC_ADAPT=1. */
static volatile uint8_t  vnd_dc_resume_mode = VND_DC_MODE_BOOT_FAST;
static volatile uint32_t vnd_dc_work_settle_ms = (uint32_t)VND_DC_WORK_SETTLE_MS;
static volatile uint32_t vnd_dc_detect_settle_ms = (uint32_t)VND_DC_DETECT_SETTLE_MS;
static volatile uint32_t vnd_dc_fast_settle_ms = (uint32_t)VND_DC_FAST_SETTLE_MS;
static volatile uint32_t vnd_dc_adapt_settle_ms = 0u;
static volatile uint32_t vnd_dc_mode_enter_ms = 0;
static volatile uint32_t vnd_dc_fast_until_ms = 0u;
static volatile uint32_t vnd_dc_adapt_updates = 0;

/* После reboot "чет/нечет" (parity) может оказаться инвертирован относительно того, что было
    во время обучения/сохранения (из-за фазировки старта DMA/TIM).
    Мы НЕ смешиваем 4 DC массива, а один раз на старте определяем swap (0/1) и дальше
    используем parity^swap при применении/адаптации. */
static uint8_t vnd_dc_parity_swap = 0;
static uint8_t vnd_dc_parity_swap_valid = 0;

static void vnd_dc_load_once(void);
static void vnd_dc_apply_and_adapt(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len, uint8_t gate_enabled);
static void vnd_dc_set_mode(uint8_t mode);
static uint8_t vnd_dc_effective_mode(uint32_t now_ms);
static uint32_t vnd_dc_active_settle_ms(uint32_t now_ms);

/* Exported counters for LCD/diagnostics (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_save_ok_count = 0;
volatile uint32_t vnd_dc_save_fail_count = 0;
volatile uint32_t vnd_dc_save_last_ms = 0;
volatile uint8_t  vnd_dc_save_last_result = 0; /* 0=none, 1=ok, 2=fail */

/* DC Adaptation control (can be frozen by host during signal detection) */
volatile uint8_t  vnd_dc_adapt_enabled = 1; /* 1=active (learning), 0=freeze (keep current values) */

/* Auto-freeze when signal swing is too large for safe DC learning. */
volatile uint8_t  vnd_dc_auto_freeze = 0; /* 1=auto-freeze by amplitude gate */

/* Public mirror of blob write_counter for LCD/debug (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_write_counter_public = 0;

/* Exported live state for LCD progress indicator */
volatile uint8_t  vnd_dc_dirty_public = 0;
volatile uint32_t vnd_dc_dirty_since_ms = 0;
volatile uint32_t vnd_dc_save_period_ms = (uint32_t)VND_DC_SAVE_PERIOD_MS;

/* DC save diagnostics */
volatile uint32_t vnd_dc_save_last_err = 0;
volatile uint32_t vnd_dc_save_last_sector_error = 0;
volatile uint32_t vnd_dc_save_last_bank = 0;
volatile uint32_t vnd_dc_save_last_sector = 0;

/* DC load diagnostics (published for LCD) */
volatile uint8_t  vnd_dc_load_flags_public = 0; /* bit0=loaded OK, bit1=erase_pending */
volatile uint16_t vnd_dc_loaded_crc16_public = 0;
volatile uint32_t vnd_dc_flash_next_off_public = 0;

static uint32_t vnd_dc_adapt_block_until_ms = 0;

void vnd_dc_request_save_to_flash(void)
{
    vnd_dc_save_request = 1u;
}

static uint32_t vnd_dc_clamp_settle_ms(uint32_t value_ms)
{
    if(value_ms < (uint32_t)VND_DC_SETTLE_MIN_MS) return (uint32_t)VND_DC_SETTLE_MIN_MS;
    if(value_ms > (uint32_t)VND_DC_SETTLE_MAX_MS) return (uint32_t)VND_DC_SETTLE_MAX_MS;
    return value_ms;
}

static void vnd_dc_reset_adapt_timestamps(void)
{
    memset(vnd_dc_last_adapt_ms, 0, sizeof(vnd_dc_last_adapt_ms));
    memset(vnd_dc_sar_budget_q16, 0, sizeof(vnd_dc_sar_budget_q16));
}

static uint32_t vnd_dc_floor_pow2_u32(uint32_t value)
{
    uint32_t p = 1u;
    while(value >= 2u && p <= (0x80000000u >> 1)){
        uint32_t next = p << 1;
        if(next > value) break;
        p = next;
    }
    return p;
}

static void vnd_dc_reset_adapt_state(void)
{
    vnd_dc_reset_adapt_timestamps();
}

static void vnd_dc_set_mode(uint8_t mode)
{
    if(mode > VND_DC_MODE_BOOT_FAST) mode = VND_DC_MODE_WORK;
    uint32_t now_ms = HAL_GetTick();
    if(mode != VND_DC_MODE_FREEZE){
        vnd_dc_resume_mode = mode;
    }
    vnd_dc_mode = mode;
    vnd_dc_mode_enter_ms = now_ms;
    vnd_dc_fast_until_ms = 0u;
    vnd_dc_adapt_enabled = (mode == VND_DC_MODE_FREEZE) ? 0u : 1u;
    vnd_dc_reset_adapt_timestamps();
}

static uint8_t vnd_dc_effective_mode(uint32_t now_ms)
{
    (void)now_ms;
    uint8_t mode = vnd_dc_mode;
    vnd_dc_fast_until_ms = 0u;
    vnd_dc_adapt_enabled = (mode == VND_DC_MODE_FREEZE) ? 0u : 1u;
    return mode;
}

static uint32_t vnd_dc_active_settle_ms(uint32_t now_ms)
{
    uint8_t mode = vnd_dc_effective_mode(now_ms);
    if(mode == VND_DC_MODE_FREEZE) return 0u;
    if(mode == VND_DC_MODE_DETECT) return vnd_dc_detect_settle_ms;
    if(mode == VND_DC_MODE_BOOT_FAST) return vnd_dc_fast_settle_ms;
    return vnd_dc_work_settle_ms;
}

static uint32_t vnd_dc_rd_le32(const uint8_t *p)
{
    return (uint32_t)p[0] |
           ((uint32_t)p[1] << 8) |
           ((uint32_t)p[2] << 16) |
           ((uint32_t)p[3] << 24);
}

static void vnd_dc_apply_config_payload(const uint8_t *payload, uint32_t payload_len)
{
    if(payload == NULL || payload_len < 2u) return;
    if(payload[0] != 1u) return; /* version */

    uint8_t mode = payload[1];
    if(payload_len >= 20u){
        uint16_t flags = (uint16_t)(payload[2] | ((uint16_t)payload[3] << 8));
        (void)flags; /* reserved for future host-side policy */

        uint32_t work_ms = vnd_dc_rd_le32(payload + 4);
        uint32_t detect_ms = vnd_dc_rd_le32(payload + 8);
        uint32_t fast_ms = vnd_dc_rd_le32(payload + 12);
        uint32_t adapt_settle_ms = vnd_dc_rd_le32(payload + 16);

        vnd_dc_work_settle_ms = vnd_dc_clamp_settle_ms(work_ms);
        vnd_dc_detect_settle_ms = vnd_dc_clamp_settle_ms(detect_ms);
        vnd_dc_fast_settle_ms = vnd_dc_clamp_settle_ms(fast_ms);

