kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
        /* Backward-compatible meaning of the last u32: host-side UI may call it
           "adaptation duration". It is not a run timer; it is a settle time for
           the selected mode, i.e. speed of continuous SAR adaptation. */
        if(adapt_settle_ms != 0u){
            uint32_t settle_ms = vnd_dc_clamp_settle_ms(adapt_settle_ms);
            if(mode == VND_DC_MODE_DETECT){
                vnd_dc_detect_settle_ms = settle_ms;
            } else if(mode == VND_DC_MODE_BOOT_FAST){
                vnd_dc_fast_settle_ms = settle_ms;
            } else if(mode == VND_DC_MODE_WORK){
                vnd_dc_work_settle_ms = settle_ms;
            }
            vnd_dc_adapt_settle_ms = settle_ms;
        } else {
            vnd_dc_adapt_settle_ms = 0u;
        }
    }

    vnd_dc_set_mode(mode);
}

typedef struct {
    uint32_t magic;
    uint32_t magic_inv;
    uint32_t fault_addr;
    uint32_t cfsr;
    uint32_t count;
} vnd_dc_recovery_t;

static volatile vnd_dc_recovery_t __attribute__((section(".noinit"))) vnd_dc_recovery;

static uint8_t vnd_dc_flash_addr_in_range(uint32_t addr)
{
    return (uint8_t)((addr >= (uint32_t)VND_DC_FLASH_ADDR) &&
                     (addr < ((uint32_t)VND_DC_FLASH_ADDR + (uint32_t)VND_DC_FLASH_SECTOR_SIZE)));
}

void vnd_dc_note_flash_fault(uint32_t fault_addr, uint32_t cfsr)
{
    if(!vnd_dc_flash_addr_in_range(fault_addr)) return;

    if(vnd_dc_recovery.magic != VND_DC_RECOVERY_MAGIC ||
       vnd_dc_recovery.magic_inv != ~VND_DC_RECOVERY_MAGIC){
        vnd_dc_recovery.count = 0;
    }
    vnd_dc_recovery.magic = VND_DC_RECOVERY_MAGIC;
    vnd_dc_recovery.magic_inv = ~VND_DC_RECOVERY_MAGIC;
    vnd_dc_recovery.fault_addr = fault_addr;
    vnd_dc_recovery.cfsr = cfsr;
    vnd_dc_recovery.count++;
}

static void vnd_dc_flash_clear_error_flags(void)
{
#if defined(FLASH_FLAG_ALL_ERRORS)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
#elif defined(FLASH_FLAG_ALL_ERRORS_BANK1)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK1);
    #if defined(FLASH_FLAG_ALL_ERRORS_BANK2)
        __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK2);
    #endif
#else
    /* Nothing to clear on this HAL variant. */
#endif
}

static void vnd_dc_flash_erase_target(uint32_t *bank, uint32_t *sector)
{
    uint32_t erase_bank = FLASH_BANK_1;
    uint32_t erase_sector;
    uint32_t rel = (uint32_t)VND_DC_FLASH_ADDR - 0x08000000u;
    uint32_t sec_global = rel / 0x20000u;

    if(sec_global >= (uint32_t)FLASH_SECTOR_TOTAL){
        sec_global = (uint32_t)FLASH_SECTOR_TOTAL - 1u;
    }

#if defined(FLASH_BANK_2)
    if(sec_global >= 4u) erase_bank = FLASH_BANK_2;
#endif

#if defined(FLASH_SECTOR_0)
    erase_sector = (uint32_t)FLASH_SECTOR_0 + sec_global;
#else
    erase_sector = sec_global;
#endif

    *bank = erase_bank;
    *sector = erase_sector;
}

static HAL_StatusTypeDef vnd_dc_erase_reserved_sector(uint32_t *sector_error,
                                                       uint32_t *erase_bank,
                                                       uint32_t *erase_sector)
{
    FLASH_EraseInitTypeDef e;
    vnd_dc_flash_erase_target(erase_bank, erase_sector);
    memset(&e, 0, sizeof(e));
    e.TypeErase = FLASH_TYPEERASE_SECTORS;
    e.Banks = *erase_bank;
    e.Sector = *erase_sector;
    e.NbSectors = 1;
    return HAL_FLASHEx_Erase(&e, sector_error);
}

static uint32_t vnd_dc_blob_commit_value(const vnd_dc_blob_t *b)
{
    uint32_t commit = 0u;
    memcpy(&commit, ((const uint8_t*)b) + VND_DC_COMMIT_OFFSET, sizeof(commit));
    return commit;
}

static void vnd_dc_blob_set_commit(vnd_dc_blob_t *b)
{
    const uint32_t commit = VND_DC_COMMIT_MAGIC;
    memcpy(((uint8_t*)b) + VND_DC_COMMIT_OFFSET, &commit, sizeof(commit));
}

static void vnd_dc_boot_recovery_erase_if_requested(void)
{
    static uint8_t checked = 0;
    if(checked) return;
    checked = 1;

    if(vnd_dc_recovery.magic != VND_DC_RECOVERY_MAGIC ||
       vnd_dc_recovery.magic_inv != ~VND_DC_RECOVERY_MAGIC){
        return;
    }

    uint32_t erase_bank = 0;
    uint32_t erase_sector = 0;
    uint32_t sector_error = 0;
    uint32_t err = 0;

    printf("[DC] RECOVERY: erase reserved flash after fault addr=0x%08lX cfsr=0x%08lX count=%lu\r\n",
           (unsigned long)vnd_dc_recovery.fault_addr,
           (unsigned long)vnd_dc_recovery.cfsr,
           (unsigned long)vnd_dc_recovery.count);

    HAL_FLASH_Unlock();
    vnd_dc_flash_clear_error_flags();
    HAL_StatusTypeDef st = vnd_dc_erase_reserved_sector(&sector_error, &erase_bank, &erase_sector);
    HAL_FLASH_Lock();

#if defined(HAL_FLASH_GetError)
    err = HAL_FLASH_GetError();
#endif
    vnd_dc_save_last_bank = erase_bank;
    vnd_dc_save_last_sector = erase_sector;
    vnd_dc_save_last_sector_error = sector_error;
    vnd_dc_save_last_err = err;
    vnd_dc_save_last_ms = HAL_GetTick();

    if(st == HAL_OK){
        vnd_dc_recovery.magic = 0;
        vnd_dc_recovery.magic_inv = 0;
        vnd_dc_flash_next_off = 0;
        vnd_dc_flash_next_off_public = 0;
        vnd_dc_load_flags_public = 0;
        printf("[DC] RECOVERY OK: erased bank=%lu sector=%lu\r\n",
               (unsigned long)erase_bank, (unsigned long)erase_sector);
    } else {
        vnd_dc_save_fail_count++;
        vnd_dc_save_last_result = 2;
        vnd_dc_loaded = 1;
        memset(vnd_dc_buf, 0, sizeof(vnd_dc_buf));
        memset(vnd_dc_pos, 0, sizeof(vnd_dc_pos));
        vnd_dc_dirty = 0;
        vnd_dc_dirty_public = 0;
        vnd_dc_dirty_since_ms = 0;
        vnd_dc_flash_next_off = VND_DC_FLASH_SECTOR_SIZE;
        vnd_dc_flash_next_off_public = vnd_dc_flash_next_off;
        printf("[DC] RECOVERY FAIL: bank=%lu sector=%lu err=0x%08lX sec_err=%lu; DC disabled for this boot\r\n",
               (unsigned long)erase_bank, (unsigned long)erase_sector,
               (unsigned long)err, (unsigned long)sector_error);
    }
}

/* Гейт DC для текущей группы усреднения (решение принимается по полному сырому буферу до 600 семплов).
    1 = DC включён (если на полном буфере есть полный размах > threshold), 0 = DC выключен. */
/* DC gate больше не привязан к stream_mode: он вычисляется в фоне по сырому буферу (mx-mn).
    stream_mode влияет только на то, что отправляется по USB. */

static uint16_t vnd_crc16_ccitt(const uint8_t *data, uint32_t len); /* объявлена ниже в файле */

/* === TIM5 sync helpers (32-bit phase counter) === */
__attribute__((unused))
static uint32_t vnd_tim5_get_tim_clk(void)
{
    uint32_t pclk1 = HAL_RCC_GetPCLK1Freq();
    uint32_t ppre1 = (RCC->D2CFGR & RCC_D2CFGR_D2PPRE1) >> RCC_D2CFGR_D2PPRE1_Pos;
    return ((ppre1 & 0x4u) != 0u) ? (pclk1 * 2u) : pclk1;
}

__attribute__((unused))
static void vnd_sync_stop_tim5(void)
{
    (void)HAL_TIM_Base_Stop(&htim5);
}

__attribute__((unused))
static void vnd_sync_start_tim5_base(void)
{
    (void)HAL_TIM_Base_Start(&htim5);
}

static void vnd_sync_set_master(uint16_t buf_rate_hz)
{
    /* TIM5 теперь используется как 32-битный счётчик фазы, не как генератор синхроимпульсов */
    (void)buf_rate_hz;
    vnd_sync_last_hz = buf_rate_hz;
}

