kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static void vnd_dc_apply_and_adapt(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len, uint8_t gate_enabled)
{
    if(!out) return;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return;
    if(ch > 1u || parity > 1u) return;

     uint8_t p = (uint8_t)(parity ^ (vnd_dc_parity_swap_valid ? vnd_dc_parity_swap : 0u));

    /* 1) Применяем DC по всему окну ВСЕГДА (если есть сохранённые значения — они должны работать сразу после reboot).
          Гейт используется только для адаптации (learning), чтобы не "разъезжаться" на сигналах без полного размаха. */
    for(uint16_t i=0;i<roi_len;i++){
        int16_t dc = vnd_dc_buf[ch][p][i];
        uint16_t v = out[i];
        int32_t y = (int32_t)v + (int32_t)dc;
        if(y < 0) y = 0;
        else if(y > 65535) y = 65535;
        out[i] = (uint16_t)y;
    }

    if(!gate_enabled){
        return; /* адаптация выключена */
    }

    uint32_t now_ms = HAL_GetTick();
    uint8_t mode = vnd_dc_effective_mode(now_ms);

    /* Проверяем режим управления адаптацией от хоста.
       FREEZE: только вычитаем DC, но не обучаемся (не меняем vnd_dc_buf). */
    if(mode == VND_DC_MODE_FREEZE || !vnd_dc_adapt_enabled){
        return;
    }

    /* На старте после reboot/load применяем DC, но не учимся некоторое время,
       чтобы «первый мусорный кадр» не уводил DC в промежуточное состояние. */
    if(vnd_dc_adapt_block_until_ms != 0u && now_ms < vnd_dc_adapt_block_until_ms){
        return;
    }

     /* 2) Адаптация DC: строго поиндексная (per-sample), time-based SAR.
         Host задаёт settle time в миллисекундах: за это время набирается бюджет
         на полный 16-битный проход последовательного приближения. Модель:
         out = raw + dc[i]; если out[i] слишком велик -> dc[i] делаем более отрицательным. */
    int64_t sum = 0;
    for(uint16_t i=0;i<roi_len;i++) sum += (int32_t)out[i];
    int32_t mean = (int32_t)(sum / (int32_t)roi_len);
    __attribute__((unused)) int32_t err = mean - 32767;

    int32_t dead = (int32_t)VND_DC_DEADBAND;
    if(dead < 0) dead = 0;

    uint8_t changed = 0;
    uint32_t settle_ms = vnd_dc_active_settle_ms(now_ms);
    if(settle_ms == 0u){
        return;
    }
    settle_ms = vnd_dc_clamp_settle_ms(settle_ms);
    uint32_t last_ms = vnd_dc_last_adapt_ms[ch][p];
    uint32_t dt_ms = (last_ms == 0u) ? 20u : (uint32_t)(now_ms - last_ms);
    vnd_dc_last_adapt_ms[ch][p] = now_ms;
    if(dt_ms == 0u){
        return;
    }
    if(dt_ms > (uint32_t)VND_DC_ADAPT_DT_MAX_MS){
        dt_ms = (uint32_t)VND_DC_ADAPT_DT_MAX_MS;
    }
    if(dt_ms > settle_ms){
        dt_ms = settle_ms;
    }

    uint32_t budget_add_q16 = (uint32_t)(((uint64_t)dt_ms * (uint64_t)VND_DC_SAR_BITS * 65536ULL) / (uint64_t)settle_ms);
    if(budget_add_q16 == 0u){
        budget_add_q16 = 1u;
    }
    uint32_t budget_q16 = vnd_dc_sar_budget_q16[ch][p] + budget_add_q16;
    uint32_t max_budget_q16 = (uint32_t)VND_DC_SAR_MAX_BITS_PER_UPDATE * 65536u;
    if(budget_q16 > max_budget_q16){
        budget_q16 = max_budget_q16;
    }
    uint32_t sar_bits = budget_q16 >> 16;
    if(sar_bits == 0u){
        vnd_dc_sar_budget_q16[ch][p] = budget_q16;
        return;
    }
    if(sar_bits > (uint32_t)VND_DC_SAR_MAX_BITS_PER_UPDATE){
        sar_bits = (uint32_t)VND_DC_SAR_MAX_BITS_PER_UPDATE;
    }
    vnd_dc_sar_budget_q16[ch][p] = budget_q16 - (sar_bits << 16);

    /* per-sample SAR correction */
    {
        for(uint16_t i=0;i<roi_len;i++){
            int32_t e = (int32_t)out[i] - 32767;
            if(e > -dead && e < dead) continue;

            int32_t dc_i32 = (int32_t)vnd_dc_buf[ch][p][i];
            for(uint32_t bit = 0u; bit < sar_bits; bit++){
                uint32_t abs_e = (e < 0) ? (uint32_t)(-e) : (uint32_t)e;
                if(abs_e <= (uint32_t)dead) break;
                uint32_t step = vnd_dc_floor_pow2_u32(abs_e);
                if(e > 0){
                    dc_i32 -= (int32_t)step;
                    e -= (int32_t)step;
                } else {
                    dc_i32 += (int32_t)step;
                    e += (int32_t)step;
                }
                if(dc_i32 < -32768){
                    dc_i32 = -32768;
                    break;
                }
                if(dc_i32 > 32767){
                    dc_i32 = 32767;
                    break;
                }
            }

            int16_t nv = (int16_t)dc_i32;
            if(nv != vnd_dc_buf[ch][p][i]){
                vnd_dc_buf[ch][p][i] = nv;
                changed = 1;
            }
        }
    }

    if(changed){
        if(!vnd_dc_dirty){
            uint32_t now_ms = HAL_GetTick();
            vnd_dc_dirty_since_ms = now_ms;
        }
        /* ограничим частоту DIRTY лога */
        {
            uint32_t now_ms = HAL_GetTick();
            if(vnd_dc_last_dirty_log_ms == 0u || (now_ms - vnd_dc_last_dirty_log_ms) > 1000u){
                vnd_dc_last_dirty_log_ms = now_ms;
                   VND_DC_LOGF("[DC] DIRTY: ch=%u p=%u mode=%u settle=%lums dt=%lums sar_bits=%lu mean=%ld err=%ld\r\n",
                       (unsigned)ch, (unsigned)p,
                       (unsigned)mode,
                       (unsigned long)settle_ms,
                       (unsigned long)dt_ms,
                       (unsigned long)sar_bits,
                       (long)mean, (long)err);
            }
        }
        vnd_dc_adapt_updates++;
        vnd_dc_dirty = 1;
        vnd_dc_dirty_public = 1;
    }
}

static void vnd_dc_load_once(void)
{
    vnd_dc_boot_recovery_erase_if_requested();
    if(vnd_dc_loaded) return;
    vnd_dc_loaded = 1;

    /* Scan journal once after reset: find last valid record + compute next write offset.
       If tail is corrupted (non-empty but invalid), mark sector as "needs erase" for next save. */
    const uint8_t *base = (const uint8_t *)(uintptr_t)VND_DC_FLASH_ADDR;
    const vnd_dc_blob_t *best = NULL;
    uint32_t best_cnt = 0;
    uint32_t next_off = 0;
    uint8_t need_erase = 0;

    for(uint32_t off = 0; (off + (uint32_t)sizeof(vnd_dc_blob_t)) <= VND_DC_FLASH_SECTOR_SIZE; off += VND_DC_SLOT_SIZE){
        const vnd_dc_blob_t *b = (const vnd_dc_blob_t *)(const void *)(base + off);
        if(b->magic == 0xFFFFFFFFu){
            next_off = off;
            break;
        }
        if(b->magic != VND_DC_MAGIC || b->ver != (uint16_t)VND_DC_VER || b->roi_len != (uint16_t)VND_DC_ROI_LEN){
            next_off = off;
            need_erase = 1;
            break;
        }
        if(vnd_dc_blob_commit_value(b) != VND_DC_COMMIT_MAGIC){
            next_off = off;
            need_erase = 1;
            break;
        }
        uint32_t data_off = (uint32_t)offsetof(vnd_dc_blob_t, dc);
        uint32_t data_len = (uint32_t)sizeof(b->dc) + (uint32_t)sizeof(b->pos);
        uint16_t crc = vnd_crc16_ccitt(((const uint8_t*)b) + data_off, data_len);
        if(crc != b->crc16){
            next_off = off;
            need_erase = 1;
            break;
        }
        if(best == NULL || b->write_counter >= best_cnt){
            best = b;
            best_cnt = b->write_counter;
        }
        next_off = off + VND_DC_SLOT_SIZE;
    }

    if(next_off > (VND_DC_FLASH_SECTOR_SIZE - VND_DC_SLOT_SIZE)){
        /* Full sector */
        need_erase = 1;
    }
    vnd_dc_flash_next_off = need_erase ? VND_DC_FLASH_SECTOR_SIZE : next_off;
    vnd_dc_flash_next_off_public = vnd_dc_flash_next_off;

