kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
typedef struct {
    uint16_t idx;
    uint16_t len;
    uint16_t maxv;
    uint8_t  ch;
} spike_info_t;

static __attribute__((unused)) void vnd_log_spike_window(const spike_info_t *si, const uint16_t *buf, uint16_t samples, uint32_t seq)
{
    if(!si || !buf) return;
    uint16_t start = si->idx;
    uint16_t end = (uint16_t)(start + si->len);
    uint16_t w0 = (start > 8) ? (uint16_t)(start - 8) : 0;
    uint16_t w1 = end + 8; if(w1 > samples) w1 = samples;
    /* Логируем только до 16 значений, чтобы не шуметь CDC */
    char line[256];
    int pos = snprintf(line, sizeof(line), "[SPIKE_DUMP] CH=%c seq=%lu idx=%u len=%u max=%u win=%u..%u vals=",
                       si->ch ? 'B' : 'A', (unsigned long)seq, (unsigned)si->idx, (unsigned)si->len, (unsigned)si->maxv,
                       (unsigned)w0, (unsigned)w1);
    uint16_t printed = 0;
    for(uint16_t i = w0; i < w1 && pos < (int)sizeof(line)-8; ++i){
        pos += snprintf(line+pos, sizeof(line)-pos, "%u,", (unsigned)buf[i]);
        if(++printed >= 16) break;
    }
    if(pos > 0 && pos < (int)sizeof(line)) line[pos-1] = 0; /* убрать последнюю запятую */
    cdc_logf("%s", line);
}

static __attribute__((unused)) uint8_t vnd_detect_spike_info(uint16_t *buf, uint16_t samples, uint16_t thr, uint16_t min_len, uint8_t ch, spike_info_t *out)
{
    if(!buf || samples < min_len || !out) return 0;
    for(uint16_t i=0; i<samples; ){
        uint16_t v = buf[i];
        if(v <= thr){ i++; continue; }
        uint16_t start = i;
        uint16_t maxv = v;
        while(i < samples && buf[i] > thr){ if(buf[i] > maxv) maxv = buf[i]; i++; }
        uint16_t len = i - start;
        if(len >= min_len){
            out->idx = start; out->len = len; out->maxv = maxv; out->ch = ch;
            return 1;
        }
    }
    return 0;
}

/* Локальная утилита: обновить LCD параметрами, присланными хостом */
/* ДИАГНОСТИКА: обновление индикации последней принятой команды на LCD и UART */
static void vnd_update_cmd_indicator(void)
{
    char cmd_str[16];
    uint32_t now = HAL_GetTick();
    uint32_t elapsed_sec = (now >= last_cmd_timestamp_ms) ? ((now - last_cmd_timestamp_ms) / 1000) : 0;
    
    /* Компактный формат для размещения после "USB:CFG" на верхней строке LCD:
       Показываем последнюю команду и сколько секунд назад она была получена */
    if (last_cmd_received == 0x20) {
        snprintf(cmd_str, sizeof(cmd_str), "ST:%lu", (unsigned long)cmd_start_count);
    } else if (last_cmd_received == 0x21) {
        snprintf(cmd_str, sizeof(cmd_str), "SP:%lu", (unsigned long)cmd_stop_count);
    } else {
        snprintf(cmd_str, sizeof(cmd_str), "--:0");
    }
    
    /* Вывод на LCD строка 0 (y=0), позиция x=80 пикселей (между USB:CFG и T2:) */
    LCD_ShowString_Size(80, 0, cmd_str, 16, YELLOW, BLACK);
    
    /* Дополнительно вывод в UART для отладки */
    if (last_cmd_received == 0x20) {
        printf("[CMD_IND] START received #%lu (at t=%lu ms, %lu sec ago)\r\n",
               (unsigned long)cmd_start_count, (unsigned long)last_cmd_timestamp_ms, (unsigned long)elapsed_sec);
        printf("[CMD_IND] START cfg: stream_mode=%u avg_n=%u async=%u chmode=%u\r\n",
               (unsigned)vnd_stream_mode, (unsigned)vnd_avg_n, (unsigned)async_mode, (unsigned)vnd_ch_mode);
    } else if (last_cmd_received == 0x21) {
        printf("[CMD_IND] STOP received #%lu (at t=%lu ms, %lu sec ago)\r\n",
               (unsigned long)cmd_stop_count, (unsigned long)last_cmd_timestamp_ms, (unsigned long)elapsed_sec);
    }
}

static void vnd_update_lcd_params(void)
{
    /* Частота блоков (пар кадров A+B): в FULL берём из периода пары, в DIAG — diag_hz */
    uint16_t block_hz = 0;
    if(full_mode) {
        uint16_t pp = vnd_pair_period_ms;
        block_hz = (pp > 0) ? (uint16_t)(1000u / pp) : 0u;
    } else {
        block_hz = diag_hz;
    }

    /* Кол-во сэмплов на канал в кадре: если явно задано командой — используем его, иначе активное */
    uint16_t frame_samples = (vnd_frame_samples_req != 0) ? vnd_frame_samples_req
                                : ((cur_samples_per_frame != 0) ? cur_samples_per_frame
                                                                : adc_stream_get_active_samples());

    /* Обновить LCD (только при изменениях внутри функции отображения) */
    // stream_display_update_host_params(
    //     host_profile,
    //     frame_samples,
    //     block_hz,
    //     win_start0, win_len0,
    //     win_start1, win_len1,
    //     (uint8_t)full_mode
    // );

    /* stream_display_update_host_params() сейчас выключен; подавляем -Werror по локальным метрикам */
    (void)block_hz;
    (void)frame_samples;
}

static void vnd_log_dc_cmd_rx(const uint8_t *data, uint32_t len)
{
    if(data == NULL || len == 0u) return;

    uint8_t cmd = data[0];
    if(cmd != VND_CMD_SET_DC_ADAPT &&
       cmd != VND_CMD_SET_DC_CONFIG &&
       cmd != VND_CMD_GET_DC_CONFIG &&
         cmd != VND_CMD_SAVE_DC_TO_FLASH &&
       cmd != VND_CMD_CALIB_DC_FAST &&
       cmd != VND_CMD_SET_STREAM_MODE){
        return;
    }

    char payload_hex[80];
    uint32_t max_dump = len > 1u ? (len - 1u) : 0u;
    if(max_dump > 12u) max_dump = 12u;

    size_t pos = 0u;
    payload_hex[0] = '\0';
    for(uint32_t i = 0u; i < max_dump; i++){
        int n = snprintf(&payload_hex[pos], sizeof(payload_hex) - pos,
                         "%02X%s",
                         (unsigned)data[1u + i],
                         (i + 1u < max_dump) ? " " : "");
        if(n <= 0) break;
        pos += (size_t)n;
        if(pos >= sizeof(payload_hex)) break;
    }

    if(max_dump == 0u){
        snprintf(payload_hex, sizeof(payload_hex), "-");
    }

    printf("[DC_CMD_RX] cmd=0x%02X len=%lu payload=%s%s\r\n",
           (unsigned)cmd,
           (unsigned long)len,
           payload_hex,
           (len > (1u + max_dump)) ? " ..." : "");

    cdc_logf("DC_CMD_RX cmd=0x%02X len=%lu payload=%s%s",
             (unsigned)cmd,
             (unsigned long)len,
             payload_hex,
             (len > (1u + max_dump)) ? " ..." : "");
}

