kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
void Vendor_Control_Task(void)
{
    USBD_VND_ProcessControlRequests();
}

/* Вычисление периода пары по требуемым samples_per_frame и текущему профилю ADC (buf_rate_hz) */
static void vnd_recompute_pair_timing(uint16_t samples_per_frame)
{
    /* Используем частоту буферов (Fs блоков/с), а не абсолютную частоту сэмплов */
    extern uint16_t adc_stream_get_buf_rate(void);
    uint16_t buf_rate = adc_stream_get_buf_rate();
    if(buf_rate == 0) buf_rate = 20; /* защита от деления на ноль */
    if(samples_per_frame == 0) samples_per_frame = 1;
    /* period_ms ≈ 1000 * samples_per_frame / buf_rate (округление) */
    uint32_t num = (uint32_t)samples_per_frame * 1000u + (uint32_t)(buf_rate/2u);
    uint32_t ms  = num / (uint32_t)buf_rate;
    if(ms == 0) ms = 1;
    vnd_pair_period_ms = (uint16_t)((ms > 1000u) ? 1000u : ms);
    /* Примечание: период больше не используется как задержка — передаём сразу при готовности данных.
       Оставляем расчёт только для информационных целей. */
    VND_LOG("PAIR_TIMING(info): samples=%u buf_rate=%u -> period≈%u ms",
        (unsigned)samples_per_frame, (unsigned)buf_rate, (unsigned)vnd_pair_period_ms);
}

/* Публичная функция: полный сброс/останов пайплайна */
void vnd_pipeline_stop_reset(int deep)
{
    /* Остановить передачу и внутренние состояния */
    streaming = 0; diag_mode_active = 0; full_mode = 1;
    stop_request = 0; pending_status = 0; start_stat_inflight = 0; status_ack_pending = 0; start_ack_done = 1;
    vnd_ep_busy = 0; vnd_tx_ready = 1; vnd_inflight = 0; sending_channel = 0xFF; pending_B = 0; pending_B_since_ms = 0;
    test_sent = 0; test_in_flight = 0; vnd_tx_kick = 1;
    /* Очистить мета-FIFO и счётчики */
    vnd_tx_meta_head = vnd_tx_meta_tail = 0; meta_push_total = meta_pop_total = meta_empty_events = meta_overflow_events = 0;
    stream_seq = 0; next_seq_to_assign = 0; dbg_produced_seq = 0; first_pair_done = 0;
    vnd_last_frame_txcplt_ms = 0; vnd_last_host_rx_ack_ms = 0; vnd_host_rx_last_counter = 0; vnd_host_rx_counter_valid = 0;
    cur_samples_per_frame = 0; cur_expected_frame_size = 0; dbg_any_valid_frame = 0;
    vnd_reset_buffers();
    /* Остановить источник данных/ADC DMA при глубоком сбросе */
    if(deep){ extern void adc_stream_stop(void); adc_stream_stop(); }
    /* Индикация */
    HAL_GPIO_WritePin(Data_ready_GPIO22_GPIO_Port, Data_ready_GPIO22_Pin, GPIO_PIN_RESET);
}

/* Реализация ранее отсутствовавшей функции */
/* Форсированное завершение зависшего тестового кадра без прихода TxCplt.
   Условия: test_in_flight == 0 (мы уже вручную сняли busy по таймауту), test_sent == 0 (ещё не засчитан),
   в FIFO присутствует meta с flags=0x80 и возраст > 60 мс.
   Вместо удаления элемента (что может рассинхронизировать последующие TxCplt), мы помечаем его как служебный:
     is_frame=0; flags=0; — таким образом последующий TxCplt безопасно извлекёт и проигнорирует.
   Гейтинг отправки A перестанет видеть TEST meta (по flags) и разрешит прогресс. */
static void vnd_force_complete_test_meta_if_stale(void)
{
#if VND_DISABLE_TEST
    /* В режиме без TEST: убедимся, что meta-FIFO не содержит блокирующих TEST записей */
    uint8_t t = vnd_tx_meta_tail;
    while(t != vnd_tx_meta_head){
        vnd_tx_meta_t *m = &vnd_tx_meta_fifo[t];
        if(m->is_frame && m->flags == 0x80){ m->is_frame = 0; m->flags = 0; }
        t = (uint8_t)((t + 1u) % VND_TX_META_FIFO);
    }
    return;
#else
    if(test_in_flight) return;
    uint8_t t = vnd_tx_meta_tail;
    uint32_t now = HAL_GetTick();
    while(t != vnd_tx_meta_head){
        vnd_tx_meta_t *m = &vnd_tx_meta_fifo[t];
        if(m->is_frame && m->flags == 0x80){
            uint32_t age = now - m->push_tick;
            if(age > 60){
                /* Форсируем */
                m->is_frame = 0; m->flags = 0; /* превращаем в служебный */
                if(!test_sent){ test_sent = 1; first_test_sent_ms = HAL_GetTick(); }
                VND_LOG("FORCE_TEST_META age=%lums depth=%u", (unsigned long)age, (unsigned)vnd_tx_meta_depth());
            }
            break; /* обрабатываем только первый TEST */
        }
        t = (uint8_t)((t + 1u) % VND_TX_META_FIFO);
    }
#endif
}

/* === Функция вывода FPS статистики и профилирования по CDC === */
void vnd_report_fps_stats(void)
{
    uint32_t now_ms = HAL_GetTick();
    uint32_t elapsed_ms = now_ms - fps_measurement_start_ms;
    
    if(elapsed_ms < 100) return; /* Слишком рано для измерения */
    
    /* Вычисляем FPS */
    float elapsed_sec = (float)elapsed_ms / 1000.0f;
    float pair_fps = (float)fps_pair_count / elapsed_sec;
    float frame_a_fps = (float)fps_frame_a_count / elapsed_sec;
    float frame_b_fps = (float)fps_frame_b_count / elapsed_sec;
    float prepare_fps = (float)fps_prepare_count / elapsed_sec;
    
    /* Вычисляем средние времена */
    uint32_t avg_prepare_us = (perf_stats.prepare_count > 0) ? 
        (perf_stats.prepare_total_us / perf_stats.prepare_count) : 0;
    uint32_t avg_transmit_us = (perf_stats.transmit_count > 0) ?
        (perf_stats.transmit_total_us / perf_stats.transmit_count) : 0;
    uint32_t avg_txcplt_us = (perf_stats.txcplt_count > 0) ?
        (perf_stats.txcplt_total_us / perf_stats.txcplt_count) : 0;
    
    cdc_logf("FPS pairs=%.1f A=%.1f B=%.1f prep=%.1f (%.1fs)",
        pair_fps, frame_a_fps, frame_b_fps, prepare_fps, elapsed_sec);
    cdc_logf("PERF prepare=%luus tx=%luus txcplt=%luus pair_int=%lu..%lums",
        (unsigned long)avg_prepare_us, (unsigned long)avg_transmit_us, 
        (unsigned long)avg_txcplt_us,
        (unsigned long)perf_stats.min_pair_interval_ms,
        (unsigned long)perf_stats.max_pair_interval_ms);
    
    fps_last_report_ms = now_ms;
}

/* === Функция вывода детального профилирования по запросу === */
void vnd_print_perf_stats(void)
{
    uint32_t now_ms = HAL_GetTick();
    uint32_t elapsed_ms = now_ms - fps_measurement_start_ms;
    float elapsed_sec = (elapsed_ms > 0) ? ((float)elapsed_ms / 1000.0f) : 0.001f;
    
    /* FPS */
    float pair_fps = (float)fps_pair_count / elapsed_sec;
    float frame_a_fps = (float)fps_frame_a_count / elapsed_sec;
    float frame_b_fps = (float)fps_frame_b_count / elapsed_sec;
    
    /* Средние времена */
    uint32_t avg_prepare_us = (perf_stats.prepare_count > 0) ? 
        (perf_stats.prepare_total_us / perf_stats.prepare_count) : 0;
    uint32_t avg_transmit_us = (perf_stats.transmit_count > 0) ?
        (perf_stats.transmit_total_us / perf_stats.transmit_count) : 0;
    uint32_t avg_txcplt_us = (perf_stats.txcplt_count > 0) ?
        (perf_stats.txcplt_total_us / perf_stats.txcplt_count) : 0;
    
    cdc_logf("=== PERFORMANCE STATS (%.1fs) ===", elapsed_sec);
    cdc_logf("FPS: pairs=%.1f A=%.1f B=%.1f", pair_fps, frame_a_fps, frame_b_fps);
    cdc_logf("COUNTS: pairs=%lu A=%lu B=%lu prep=%lu",
        (unsigned long)fps_pair_count, (unsigned long)fps_frame_a_count,
        (unsigned long)fps_frame_b_count, (unsigned long)fps_prepare_count);
    cdc_logf("TIMING: prepare=%luus tx=%luus txcplt=%luus",
        (unsigned long)avg_prepare_us, (unsigned long)avg_transmit_us,
        (unsigned long)avg_txcplt_us);
    cdc_logf("INTERVAL: min=%lums max=%lums",
        (unsigned long)perf_stats.min_pair_interval_ms,
        (unsigned long)perf_stats.max_pair_interval_ms);
    
    /* Диагностика ADC */
    extern volatile uint32_t frame_wr_seq, frame_rd_seq;
    cdc_logf("ADC: wr=%lu rd=%lu skipped=%lu",
        (unsigned long)frame_wr_seq, (unsigned long)frame_rd_seq,
        (unsigned long)dbg_skipped_frames);
}

/* Отправка отложенного STAT только из таска */
static void vnd_try_send_pending_status_from_task(void)
{
    /* В диагностическом режиме полностью запрещаем любые STAT по bulk-IN,
       чтобы исключить окна между A и B. Для статуса используйте EP0 (ctrl).
       Также ACK-STOP в DIAG не отправляем через bulk (см. обработчик STOP). */
    if(diag_mode_active){ return; }
    if(!pending_status) return;
    /* Нельзя отправлять STAT, если есть незавершённая передача (даже если busy временно сброшен) */
    if(vnd_ep_busy || vnd_inflight) return;
    uint16_t l = vnd_build_status((uint8_t*)status_buf, sizeof(status_buf));
    if(!l) { pending_status = 0; return; } /* (очистка дублирующего кода STAT уже выполнена выше) */
    vnd_status_permit_once = 1;
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = l; vnd_last_tx_start_ms = HAL_GetTick();
    vnd_mark_service_inflight();
    if(USBD_VND_Transmit(&hUsbDeviceHS, (uint8_t*)status_buf, l) == USBD_OK){
        vnd_tx_meta_after((uint8_t*)status_buf, l);
        VND_LOG("STAT_TX pending(task) len=%u depth=%u", l, (unsigned)vnd_tx_meta_depth());
        if(stop_request){ stop_stat_inflight = 1; }
        pending_status = 0;
    } else {
        VND_LOG("STAT_TX pending(task) busy/fail");
        vnd_status_permit_once = 0;
        vnd_rollback_tx_start();
    }
}

