kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static USBD_StatusTypeDef __attribute__((unused)) vnd_transmit_frame(uint8_t *buf, uint16_t len, uint8_t is_test, uint8_t allow_zero_samples, const char *tag)
{
    (void)is_test; dbg_tx_attempt++;
    vnd_last_tx_pace_busy = 0u;
    if(!vnd_validate_frame(buf, len, is_test, allow_zero_samples)){ dbg_tx_reject++; vnd_error_counter++; if(vnd_last_error == 0) vnd_last_error = 3; VND_LOG("TX_REJECT %s", tag ? tag : "?"); return USBD_FAIL; }
    if(!vnd_frame_pace_ready(HAL_GetTick())){
        vnd_last_tx_pace_busy = 1u;
        vnd_tx_kick = 1u;
        return USBD_BUSY;
    }
    if(!vnd_tx_ready || vnd_ep_busy || vnd_inflight){ vnd_error_counter++; VND_LOG("TX_SKIP busy/inflight tag=%s", tag ? tag : "?"); return USBD_BUSY; }
    {
        extern uint8_t USBD_VND_TxIsBusy(void);
        if(USBD_VND_TxIsBusy()){
            dbg_resend_blocked++;
            vnd_tx_kick = 1;
            VND_LOG("TX_DEFER ll_busy tag=%s", tag ? tag : "?");
            return USBD_BUSY;
        }
    }
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_inflight = 1; vnd_last_tx_len = len; vnd_last_tx_start_ms = HAL_GetTick();

    /* Фиксируем метаданные кадра; НЕ переписываем seq перед отправкой.
       Последовательность пар контролируется строго: seq фиксируется при сборке пары,
       а инкремент выполняется только по завершению B (TxCplt). Это исключает случаи,
       когда задержавшийся B получает «будущий» seq. */
    uint8_t is_frame=0, flags=0; uint32_t seq_field=0; int rewrote_seq = 0;
    if(len >= VND_FRAME_HDR_SIZE){
        vnd_frame_hdr_t *hh = (vnd_frame_hdr_t*)buf;
        if(hh->magic == 0xA55A){ is_frame = 1; flags = hh->flags; seq_field = hh->seq; }
    }

    /* Зафиксируем точный тип текущего кадра в полёте */
    if(len >= VND_FRAME_HDR_SIZE){ const vnd_frame_hdr_t *hh = (const vnd_frame_hdr_t*)buf; if(hh->magic==0xA55A){ inflight_is_frame = 1; inflight_flags = hh->flags; inflight_seq = hh->seq; } else { inflight_is_frame = 0; inflight_flags = 0; inflight_seq = 0; } } else { inflight_is_frame = 0; inflight_flags = 0; inflight_seq = 0; }
    (void)flags; (void)seq_field; /* для сборок с отключёнными логами */
    USBD_StatusTypeDef rc = USBD_VND_Transmit(&hUsbDeviceHS, buf, len);
    if(rc != USBD_OK){
        dbg_resend_blocked++; vnd_error_counter++;
        if(rc != USBD_BUSY && vnd_last_error == 0) vnd_last_error = 4;
        /* Диагностика LL: получим last rc/len и флаг занятости */
        extern uint8_t USBD_VND_TxIsBusy(void);
        extern uint8_t USBD_VND_LastTxRC(void);
        extern uint16_t USBD_VND_LastTxLen(void);
        uint8_t ll_busy = USBD_VND_TxIsBusy(); uint8_t ll_rc = USBD_VND_LastTxRC(); uint16_t ll_len = USBD_VND_LastTxLen();
        (void)ll_busy; (void)ll_rc; (void)ll_len;
        VND_LOG("TX_FAIL tag=%s rc=%d len=%u ll_busy=%u last_rc=%u last_len=%u", tag?tag:"?", (int)rc, (unsigned)len, (unsigned)ll_busy, (unsigned)ll_rc, (unsigned)ll_len);
        vnd_rollback_tx_start();
        vnd_tx_kick = 1;
    }
    else {
        /* Фиксируем метаданные ТОЛЬКО после успешного запуска передачи, иначе не сместим FIFO зря */
        vnd_tx_meta_after(buf, len);
        if(is_frame){
            const vnd_frame_hdr_t *lh = (const vnd_frame_hdr_t*)buf;
            (void)lh;
            if(rewrote_seq){
                VND_LOG("SEND tag=%s hdr.seq=%lu (rewrote) flags=0x%02X cur_stream_seq=%lu len=%u", tag ? tag : "?", (unsigned long)lh->seq, (unsigned)lh->flags, (unsigned long)stream_seq, len);
            } else {
                VND_LOG("SEND tag=%s hdr.seq=%lu flags=0x%02X cur_stream_seq=%lu len=%u", tag ? tag : "?", (unsigned long)lh->seq, (unsigned)lh->flags, (unsigned long)stream_seq, len);
            }
        } else {
            VND_LOG("SEND tag=%s (no-hdr) cur_stream_seq=%lu len=%u", tag ? tag : "?", (unsigned long)stream_seq, len);
        }
        /* Дублирование в CDC (работает для кадров ADC0/ADC1 и диагностических) */
        vnd_cdc_duplicate_preview(buf, len, tag);
    }
    return rc;
}

/* Упрощённая диагностическая пара A/B: подготовка буферов по текущему cur_samples_per_frame */
static void vnd_diag_prepare_pair(uint32_t seq, uint16_t samples)
{
    if(samples == 0) samples = VND_DEFAULT_TEST_SAMPLES;
    if(samples > VND_MAX_SAMPLES) samples = VND_MAX_SAMPLES;
    uint16_t base_len = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)samples*2u);
    /* Паддинг до кратности 512 (HS max packet); кратность 64 обеспечивает совместимость и для FS */
    uint16_t pad_unit = 512u;
    uint16_t padded = (uint16_t)(((uint32_t)(base_len + (pad_unit-1u)) / pad_unit) * pad_unit);
    if (padded < base_len) padded = base_len; /* защита от переполнения (не ожидается) */
    diag_frame_len = padded;
    /* A */
    memset(diag_a_buf, 0, diag_frame_len);
    vnd_frame_hdr_t *ha = (vnd_frame_hdr_t*)diag_a_buf;
    ha->magic = 0xA55A; ha->ver = 0x01; ha->flags = 0x01; ha->seq = seq; ha->timestamp = HAL_GetTick(); ha->total_samples = samples;
    for(uint16_t i=0;i<samples;i++){ uint16_t v=i; diag_a_buf[VND_FRAME_HDR_SIZE+2*i]=(uint8_t)(v & 0xFF); diag_a_buf[VND_FRAME_HDR_SIZE+2*i+1]=(uint8_t)(v>>8); }
    /* B */
    memset(diag_b_buf, 0, diag_frame_len);
    vnd_frame_hdr_t *hb = (vnd_frame_hdr_t*)diag_b_buf;
    hb->magic = 0xA55A; hb->ver = 0x01; hb->flags = 0x02; hb->seq = seq; hb->timestamp = ha->timestamp; hb->total_samples = samples;
    for(uint16_t i=0;i<samples;i++){ uint16_t v=0x0100u+i; diag_b_buf[VND_FRAME_HDR_SIZE+2*i]=(uint8_t)(v & 0xFF); diag_b_buf[VND_FRAME_HDR_SIZE+2*i+1]=(uint8_t)(v>>8); }
    diag_current_pair_seq = seq; /* зафиксируем seq текущей пары для гарантии совпадения A/B */
}

/* Попытка отправки диагностического кадра: A, затем (если не A-only) B */
static int vnd_diag_try_tx(void)
{
    if(vnd_ep_busy) return 0;
    if(diag_frame_len == 0) return 0;
#if VND_DIAG_SEND_A_ONLY
    if(!vnd_validate_frame(diag_a_buf, diag_frame_len, 0, 0x02)) return 0; /* allow padding */
    if(vnd_transmit_frame(diag_a_buf, diag_frame_len, 0, 0, "ADC0") == USBD_OK){
        sending_channel = 0; /* для корректной статистики */
        return 1;
    } else { return 0; }
#else
    /* В DIAG режиме используем pending_B как главный флаг: если он установлен — шлём B, иначе A */
    if(pending_B)
    {
        if(!vnd_validate_frame(diag_b_buf, diag_frame_len, 0, 0x02)) return 0; /* allow padding */
        /* Прямое копирование полей из заголовка A: seq/timestamp/ns всегда совпадают в паре */
        if(diag_frame_len >= VND_FRAME_HDR_SIZE){
            vnd_frame_hdr_t *hb = (vnd_frame_hdr_t*)diag_b_buf;
            const vnd_frame_hdr_t *ha = (const vnd_frame_hdr_t*)diag_a_buf;
            if(hb->magic == 0xA55A && ha->magic == 0xA55A){
                hb->seq = ha->seq;
                hb->timestamp = ha->timestamp;
                hb->total_samples = ha->total_samples;
            }
        }
        if(vnd_transmit_frame(diag_b_buf, diag_frame_len, 0, 0x02, "ADC1") == USBD_OK){
            sending_channel = 1; /* информативно */
            /* печать в CDC отключена для максимальной скорости */
            return 1;
        } else { return 0; }
    }
    /* Иначе шлём A, когда EP свободен */
    /* Allow padded A-frames as well (len >= expected and multiple of 64/512) */
    if(!vnd_validate_frame(diag_a_buf, diag_frame_len, 0, 0x02)) return 0; /* allow padding */
    /* Безопасная синхронизация seq для A: если по какой-то причине новая пара
       ещё не была собрана, принудительно проставим актуальный stream_seq в hdr */
    if(diag_frame_len >= VND_FRAME_HDR_SIZE){
        vnd_frame_hdr_t *ha = (vnd_frame_hdr_t*)diag_a_buf;
        if(ha->magic == 0xA55A){
            if(ha->seq != stream_seq){
                ha->seq = stream_seq;
            }
            /* Всегда фиксируем текущий seq A как seq пары для последующего B */
            diag_current_pair_seq = ha->seq;
        }
    }
    if(vnd_transmit_frame(diag_a_buf, diag_frame_len, 0, 0x02, "ADC0") == USBD_OK){
        sending_channel = 0; /* ожидаем B после TxCplt A */
        /* Закрываем STAT-окно между A и B: сразу помечаем ожидание B */
        pending_B = 1; pending_B_since_ms = HAL_GetTick();
        /* печать в CDC отключена для максимальной скорости */
        return 1;
    } else { return 0; }
#endif
}

/* === Немедленная отправка B после завершения A (внутри TxCplt) === */
static int vnd_try_send_B_immediate(void)
{
    if(vnd_ep_busy) return 0;
    /* DIAG режим: используем заранее подготовленный diag_b_buf с текущим seq */
    if(diag_mode_active){
        if(!pending_B) return 0;
        if(diag_frame_len == 0) return 0;
        if(diag_frame_len >= VND_FRAME_HDR_SIZE){
            vnd_frame_hdr_t *hb = (vnd_frame_hdr_t*)diag_b_buf;
            const vnd_frame_hdr_t *ha = (const vnd_frame_hdr_t*)diag_a_buf;
            /* В DIAG заголовок B копируем из A для гарантированной идентичности пары */
            if(hb->magic == 0xA55A && ha->magic == 0xA55A){
                hb->seq = ha->seq;
                hb->timestamp = ha->timestamp;
                hb->total_samples = ha->total_samples;
            }
        }
        if(!vnd_validate_frame(diag_b_buf, diag_frame_len, 0, 0x02)) return 0;
        if(vnd_transmit_frame(diag_b_buf, diag_frame_len, 0, 0x02, "ADC1-IMM") == USBD_OK){
            sending_channel = 1; /* B в полёте */
            return 1;
        }
        return 0;
    }
    /* Полный режим: отправляем B из текущей пары (pair_send_idx), если READY */
    ChanFrame *fB = &g_frames[pair_send_idx][1];
    if(fB->st != FB_READY) return 0;
    if(!vnd_strict_slot_ready_for_stream(pair_send_idx)) return 0;
    if(vnd_transmit_frame(fB->buf, fB->frame_size, 0, 0, "ADC1-IMM") == USBD_OK){
        fB->st = FB_SENDING; sending_channel = 1;
        return 1;
    }
    return 0;
}

/* === Немедленная отправка A следующей пары после завершения B (внутри TxCplt) === */
static int vnd_try_send_A_nextpair_immediate(void)
{
    if(vnd_ep_busy) return 0;
    /* После B мы уже сдвинули pair_send_idx/seq во внешней логике — тут пытаемся сразу выстрелить A новой пары */
    if(diag_mode_active){
        /* Подготовим следующую пару под новый stream_seq и сразу пошлём A */
        vnd_diag_prepare_pair(stream_seq, cur_samples_per_frame ? cur_samples_per_frame : diag_samples);
        if(!vnd_validate_frame(diag_a_buf, diag_frame_len, 0, 0x02)) return 0;
        if(vnd_transmit_frame(diag_a_buf, diag_frame_len, 0, 0x02, "ADC0-IMM") == USBD_OK){
            sending_channel = 0; pending_B = 1; pending_B_since_ms = HAL_GetTick();
            return 1;
        }
        return 0;
    }
    /* Полный режим: убедимся, что в буфере подготовки есть готовый A текущей пары; если нет — попробуем собрать */
    ChanFrame *fA = &g_frames[pair_send_idx][0];
    if(fA->st != FB_READY){
        vnd_prepare_pair();
        fA = &g_frames[pair_send_idx][0];
        if(fA->st != FB_READY) return 0;
    }
    if(!vnd_strict_slot_ready_for_stream(pair_send_idx)) return 0;
    if(vnd_transmit_frame(fA->buf, fA->frame_size, 0, 0, "ADC0-IMM") == USBD_OK){
        fA->st = FB_SENDING; sending_channel = 0; pending_B = 1; pending_B_since_ms = HAL_GetTick();
        return 1;
    }
    return 0;
}

/* Лог структуры заголовка кадра для отладки */
static void vnd_log_hdr_layout(void){
#if VND_ENABLE_LOG
    VND_LOG("HDR sz=%u off.magic=%u off.seq=%u off.timestamp=%u off.total=%u", (unsigned)sizeof(vnd_frame_hdr_t),
            (unsigned)offsetof(vnd_frame_hdr_t,magic), (unsigned)offsetof(vnd_frame_hdr_t,seq),
            (unsigned)offsetof(vnd_frame_hdr_t,timestamp), (unsigned)offsetof(vnd_frame_hdr_t,total_samples));
#endif
}

/* Экстренный keepalive: формирует короткий тестовый кадр даже если test_sent уже помечен по FALLTHRU,
   при условии что dbg_tx_cplt==0 (ни одного подтверждённого TX) и EP свободен. */
static void __attribute__((unused)) vnd_emergency_keepalive(uint32_t now_ms)
{
    if(vnd_ep_busy) return;
    if(dbg_tx_cplt != 0) return; /* уже что-то передали успешно */
    /* Не чаще чем раз в 40 мс */
    static uint32_t last_emerg_ms = 0;
    if(now_ms - last_emerg_ms < 40) return;
    last_emerg_ms = now_ms;
    uint8_t tbuf[32+16]; memset(tbuf,0,sizeof(tbuf));
    vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)tbuf;
    h->magic = 0xA55A; h->ver = 0x01; h->flags = 0x80; h->seq = 0; h->timestamp = HAL_GetTick(); h->total_samples = 8;
    for(uint16_t i=0;i<8;i++){ tbuf[32+2*i]=(uint8_t)i; tbuf[32+2*i+1]=(uint8_t)(i>>8); }
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = sizeof(tbuf); vnd_last_tx_start_ms = HAL_GetTick();
    if(USBD_VND_Transmit(&hUsbDeviceHS, tbuf, sizeof(tbuf)) == USBD_OK){
        vnd_tx_meta_after(tbuf, (uint16_t)sizeof(tbuf));
        test_in_flight = 1; VND_LOG("EMERG_TEST_TX (no TXCPLT yet) depth=%u", (unsigned)vnd_tx_meta_depth());
    } else { vnd_tx_ready = 1; vnd_ep_busy = 0; VND_LOG("EMERG_TEST_BUSY"); }
}

/* Отправка единственного тестового кадра (строго из таска) */
static void vnd_try_send_test_from_task(void)
{
#if VND_DISABLE_TEST
    /* Тестовые кадры запрещены — ничего не делаем */
    return;
#endif
    if(!streaming) return;
    if(diag_mode_active) return;
    /* Как только начали готовить/слать реальные кадры — больше не шлём TEST */
    if(dbg_any_valid_frame) return;
    if(test_sent || test_in_flight) return;
    if(vnd_ep_busy) return;
    /* Бэкофф: не пытаться слать тест чаще, чем раз в 50 мс */
    static uint32_t last_try_ms = 0;
    uint32_t now = HAL_GetTick();
    if (now - last_try_ms < 50) return;
    last_try_ms = now;
    uint8_t tbuf[32+16]; memset(tbuf,0,sizeof(tbuf));
    vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)tbuf;
    h->magic = 0xA55A; h->ver = 0x01; h->flags = 0x80; h->seq = 0; h->timestamp = HAL_GetTick(); h->total_samples = 8;
    for(uint16_t i=0;i<8;i++){ tbuf[32+2*i]=(uint8_t)i; tbuf[32+2*i+1]=(uint8_t)(i>>8); }
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = sizeof(tbuf); vnd_last_tx_start_ms = HAL_GetTick();
    if(USBD_VND_Transmit(&hUsbDeviceHS, tbuf, sizeof(tbuf)) == USBD_OK){
        vnd_tx_meta_after(tbuf, (uint16_t)sizeof(tbuf));
        test_in_flight = 1;
        VND_LOG("TEST_TX from task depth=%u", (unsigned)vnd_tx_meta_depth());
        /* Не пытаемся сразу слать рабочий кадр — ждём завершение TEST,
           чтобы не попасть на BUSY/ZLP гонки. Далее обычная логика отправит A/B. */
    } else {
        VND_LOG("TEST_TX busy/fail");
        vnd_tx_ready = 1; vnd_ep_busy = 0;
    }
}

void __attribute__((unused)) vnd_diag_send64_once(void)
{
    static uint8_t sent = 0;
    if(sent) return;
    if(hUsbDeviceHS.dev_state != USBD_STATE_CONFIGURED) return; /* ждём конфигурации */
    if(streaming) return; /* чтобы не мешать основной логике */
    if(vnd_ep_busy) return; /* подождём освобождения */
    uint8_t diag[64];
    for(int i = 0; i < 64; i++) diag[i] = (uint8_t)i;
    memcpy(diag, "STAT", 4); /* чтобы на хосте легко найти */
    diag[4] = 0x42;           /* тестовая версия */
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = sizeof(diag); vnd_last_tx_start_ms = HAL_GetTick();
    USBD_StatusTypeDef rc = USBD_VND_Transmit(&hUsbDeviceHS, diag, (uint16_t)sizeof(diag));
    if(rc == USBD_OK){
        /* Чтобы USBD_VND_TxCplt() не получил пустую мету — положим служебную запись */
        vnd_tx_meta_after(diag, (uint16_t)sizeof(diag)); /* is_frame=0 */
        sent = 1;
        VND_LOG("DIAG64 rc=OK");
    } else {
        VND_LOG("DIAG64 rc=%d", rc);
        vnd_tx_ready = 1; vnd_ep_busy = 0; /* откатим флаги при неудаче */
    }
}

/* Основной периодический таск */
void __attribute__((unused)) Vendor_Stream_Task(void)
{
    dbg_task_calls++;
    vnd_note_task_entry(HAL_GetTick());
    /* Сервис EP0: выполняем отложенные SOFT/DEEP RESET без блокировки SETUP */
    USBD_VND_ProcessControlRequests();

    /* Принудительная загрузка DC после reboot: не зависит от stream_mode/ROI. */
    vnd_dc_load_once();

    /* DC (always-on): загрузка по запросу + фоновая адаптация/сохранение не зависят от stream_mode.
       stream_mode влияет только на формирование USB кадров. */
    if(vnd_dc_load_request){
        vnd_dc_load_request = 0;
        vnd_dc_load_once();
    }
    {
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){
            if(win_auto){
                vnd_apply_auto_roi_window();
                roi_start = win_start0;
                roi_len = win_len0;
            } else {
                roi_start = (uint16_t)VND_ROI_BASE_START_200HZ;
                roi_len = (uint16_t)VND_ROI_LEN_DEFAULT;
            }
        }
        if(!(streaming && full_mode && !diag_mode_active && vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)){
            vnd_dc_background_step(roi_start, roi_len);
        }
        vnd_dc_try_save_periodic();
    }

    /* Sync master/slave: только наблюдаем входную частоту; локальный TIM15 остаётся
       на профильной базе и не подстраивается автоматически у SLAVE. */
    {
        uint32_t now_ms = HAL_GetTick();
        if(vnd_sync_mode == VND_SYNC_MODE_MASTER){
            uint16_t hz = adc_stream_get_buf_rate();
            if(hz != 0u && hz != vnd_sync_last_hz){
                vnd_sync_set_master(hz);
            }
            vnd_sync_ok_public = 1u;
        } else if(vnd_sync_mode == VND_SYNC_MODE_SLAVE){
            uint16_t hz = vnd_sync_pending_hz;
            if(hz != 0u && (now_ms - vnd_sync_last_apply_ms) > 200u){
                vnd_sync_pending_hz = 0;
                vnd_sync_last_apply_ms = now_ms;
                /* Frequency capture kept for diagnostics only.
                   Do not change buf_rate/TIM15 divider on slave automatically. */
                if(win_auto && (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)){
                    uint16_t prev_start = win_start0;
                    vnd_apply_auto_roi_window();
                    if(win_start0 != prev_start){
                        vnd_avg_reset();
                        vnd_update_lcd_params();
                    }
                }
            }
            {
                extern volatile uint32_t sync_last_edge_ms;
                if(sync_last_edge_ms != 0u && (now_ms - sync_last_edge_ms) <= 1000u){
                vnd_sync_ok_public = 1u;
            } else {
                vnd_sync_ok_public = 0u;
            }
            }
        }
    }

