kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* Ниже — обычная ветка для полнофункционального режима */
    if(!eff_is_frame){
        /* STAT/DCCF/служебные ответы не должны закрывать A/B пару.
           Раньше этот callback мог двигать pending_B/stream_seq по старому sending_channel,
           что давало редкую рассинхронизацию после bulk GET_STATUS или позднего TxCplt. */
        (void)prev_sending;
        vnd_tx_kick = 1;
        return;
    }
    uint8_t fl = eff_flags;
    uint8_t fl_ch_bits = (uint8_t)(fl & 0x03u);
    if(fl == 0x80){
        /* TEST */
        sending_channel = 0xFF; /* тест одиночный */
        vnd_tx_kick = 1; return;
    }
    uint8_t tx_slot = pair_send_idx;
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        vnd_align_strict_pair_cursor();
        int seq_slot = vnd_find_pair_by_seq(eff_seq);
        if(seq_slot >= 0){
            tx_slot = (uint8_t)seq_slot;
        }
    }
    if(fl_ch_bits == 0x01){
        /* Это канал A */
        if(pending_B){ VND_LOG("WARN A_WHILE_PENDING_B seq=%lu hdr.seq=%lu", (unsigned long)stream_seq, (unsigned long)eff_seq); }
        if(eff_seq != stream_seq){
            VND_LOG("WARN A_SEQ_MISMATCH hdr=%lu stream_seq=%lu", (unsigned long)eff_seq, (unsigned long)stream_seq);
        }
        static uint8_t first_a_txcplt_logged = 0; if(!first_a_txcplt_logged){ first_a_txcplt_logged = 1; VND_LOG("FIRST_A txcplt seq=%lu", (unsigned long)eff_seq); }
        dbg_tx_sent++; dbg_sent_ch0_total++; dbg_sent_seq_adc0++;
        /* Добавим число сэмплов канала A из текущей пары */
        vnd_total_tx_samples += (uint64_t)g_frames[tx_slot][0].samples;
        if(vnd_ch_mode == 0){
            /* A-only: закрываем пару сразу */
            vnd_consume_strict_fifo_pair(tx_slot);
            vnd_clear_pair_slot(tx_slot);
            sending_channel = 0xFF;
            pending_B = 0; pending_B_since_ms = 0;
            if(eff_seq == stream_seq){
                pair_send_idx = (uint8_t)((tx_slot + 1u) % VND_PAIR_BUFFERS);
                stream_seq++; dbg_produced_seq++; if(!first_pair_done){ first_pair_done = 1; }
            }
            /* Пытаемся немедленно отправить следующий A */
            if(!vnd_try_send_A_nextpair_immediate()){ vnd_tx_kick = 1; return; } else { return; }
        } else {
            /* пометим A как завершённый для наглядности статуса */
            g_frames[tx_slot][0].st = FB_FILL;
            sending_channel = 0xFF;
            if(eff_seq == stream_seq){
                pair_send_idx = tx_slot;
                /* Запускаем ожидание B ровно здесь */
                pending_B = 1; pending_B_since_ms = HAL_GetTick();
            }
            /* В AVG_ROI не стартуем следующий USB IN прямо из DataIn/TxCplt.
               У master это редкое re-entrant окно оставляло B в FB_SENDING при уже свободном EP.
               Vendor_Stream_Task отправит B на следующем проходе, сохранив порядок A->B. */
            if(vnd_stream_mode == VND_STREAM_MODE_LATEST){
                if(!vnd_try_send_B_immediate()){
                    vnd_tx_kick = 1; return;
                } else { return; }
            }
            vnd_tx_kick = 1; return;
        }
    } else if(fl_ch_bits == 0x02){
    /* Канал B завершён — закрываем пару */
        if(!pending_B){ VND_LOG("WARN B_WITHOUT_PENDING seq=%lu hdr.seq=%lu", (unsigned long)stream_seq, (unsigned long)eff_seq); }
        if(eff_seq != stream_seq){
            VND_LOG("WARN B_SEQ_MISMATCH hdr=%lu stream_seq=%lu", (unsigned long)eff_seq, (unsigned long)stream_seq);
        }
        static uint8_t first_b_logged = 0; if(!first_b_logged){ first_b_logged = 1; VND_LOG("FIRST_B txcplt seq=%lu", (unsigned long)eff_seq); }
    dbg_tx_sent++; dbg_sent_ch1_total++; dbg_sent_seq_adc1++;
    vnd_total_tx_samples += (uint64_t)g_frames[tx_slot][1].samples;
        vnd_consume_strict_fifo_pair(tx_slot);
        vnd_clear_pair_slot(tx_slot);
        if(eff_seq == stream_seq){
            pair_send_idx = (uint8_t)((tx_slot + 1u) % VND_PAIR_BUFFERS);
            stream_seq++; dbg_produced_seq++;
        }
        pending_B = 0; pending_B_since_ms = 0; sending_channel = 0xFF;
        if(!first_pair_done){ first_pair_done = 1; }
        /* AVG_ROI продолжает из task-loop, без нового USB IN из TxCplt. */
        if(vnd_stream_mode == VND_STREAM_MODE_LATEST){
            if(!vnd_try_send_A_nextpair_immediate()){
                /* Без планирования задержек: следующая пара начнётся как только готова */
                vnd_tx_kick = 1; return;
            } else { return; }
        }
        vnd_tx_kick = 1; return;
    } else {
        VND_LOG("WARN UNKNOWN FLAGS 0x%02X in TxCplt", (unsigned)fl);
        sending_channel = 0xFF;
        /* РЕЗЕРВ: если классификация не распознала, но прямо перед этим слали B — закроем пару */
        if(pending_B && (prev_sending == 1 || last_tx_flags == 0x02)){
            vnd_consume_strict_fifo_pair(pair_send_idx);
            ChanFrame *f0 = &g_frames[pair_send_idx][0];
            ChanFrame *f1 = &g_frames[pair_send_idx][1];
            f0->st = f1->st = FB_FILL;
            pair_send_idx = (pair_send_idx + 1u) % VND_PAIR_BUFFERS;
            stream_seq++; dbg_produced_seq++;
            pending_B = 0; pending_B_since_ms = 0; sending_channel = 0xFF;
            /* Без планирования задержек */
            VND_LOG("FALLBACK_CLOSE_PAIR after UNKNOWN meta (assume B)");
            vnd_tx_kick = 1; return;
        }
        vnd_tx_kick = 1; return;
    }
}

/* Приём команд */
void USBD_VND_DataReceived(const uint8_t *data, uint32_t len)
{
    if(!len) return;
    uint8_t cmd = data[0];
    static uint32_t rcv_count = 0;
    rcv_count++;
    VND_LOG("CMD 0x%02X len=%lu", cmd, (unsigned long)len);
    vnd_log_dc_cmd_rx(data, len);
    switch(cmd)
    {
        case VND_CMD_START_STREAM:
        {
            /* ДИАГНОСТИКА: фиксируем прием команды START */
            last_cmd_received = 0x20;
            last_cmd_timestamp_ms = HAL_GetTick();
            cmd_start_count++;
            vnd_update_cmd_indicator();
            
