kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
            /* Разрешаем START в любое время: мягко перезапускаем поток */
                VND_LOG("START_STREAM received");
                vnd_reset_buffers();
                pair_send_idx = 0; pair_fill_idx = 0; sending_channel = 0xFF; pending_B = 0; pending_B_since_ms = 0;
                /* Сброс фиксации размера и планировщика */
                cur_samples_per_frame = 0; cur_expected_frame_size = 0;
                vnd_next_pair_ms = 0;
                /* Состояние теста/ACK */
                test_in_flight = 0; test_pending = 0;
                vnd_async_state_reset_req = 1;
#if VND_DISABLE_TEST
                test_sent = 1; /* тест отключён: считать выполненным */
#else
                test_sent = 0;
#endif
                start_stat_planned = 0; start_stat_inflight = 0; start_ack_done = 1; /* ACK считаем выполненным логически */
                pending_status = 0; status_ack_pending = 0; /* не пытаться слать STAT через IN */
                vnd_error_counter = 0;
                vnd_last_error = 0;
                vnd_last_frame_txcplt_ms = 0;
                vnd_last_host_rx_ack_ms = 0;
                vnd_host_rx_last_counter = 0;
                vnd_host_rx_counter_valid = 1u;
                /* Синхронизация последовательностей пар */
                stream_seq = 0; next_seq_to_assign = 0; dbg_produced_seq = 0;
                first_pair_done = 0;
                dbg_sent_ch0_total = 0; dbg_sent_ch1_total = 0;
                start_cmd_ms = HAL_GetTick();
                /* Помечаем состояние ожидания первой передачи */
                vnd_pending_init = 1;
                vnd_stream_active = 0;
                /* Снимем DMA снапшот для контроля таймаута */
                adc_stream_debug_t dbg; adc_stream_get_debug(&dbg);
                dma_snapshot_full0 = dbg.dma_full0; dma_snapshot_full1 = dbg.dma_full1;
                /* Зафиксировать размер кадра для полного режима из vnd_frame_samples_req (если не задан хостом, используем дефолт) */
                if (full_mode) {
                    uint16_t before = vnd_frame_samples_req;
                    /* Если хост не задал vnd_frame_samples_req через SET_FRAME_SAMPLES, используем дефолт */
                    if(vnd_frame_samples_req == 0) {
                        /* Если хост не задал размер кадра, используем активный размер профиля ADC */
                        uint16_t prof_ns = adc_stream_get_active_samples();
                        if(prof_ns == 0) prof_ns = 1; /* защита от нуля */
                        vnd_frame_samples_req = prof_ns;
                    }
                    VND_LOG("START_CFG req=%u trunc=%u", vnd_frame_samples_req, vnd_trunc_samples);
                    cdc_logf("START_CFG full_mode req_before=%u req_after=%u trunc=%u", before, vnd_frame_samples_req, vnd_trunc_samples);
                    vnd_recompute_pair_timing(vnd_frame_samples_req);
                    cur_samples_per_frame = 0; /* снять lock, чтобы применилось немедленно */
                    cur_expected_frame_size = 0;
                }
                /* USB START не должен ломать текущую фазу маркера/состояние передатчика. */
                vnd_apply_tx_enable_outputs();
                /* Синхронизация всегда активна и не должна сбрасываться при START */
                if(vnd_sync_mode_public == VND_SYNC_MODE_SLAVE){
                    extern volatile uint8_t sync_restart_on_edge;
                    extern volatile uint8_t g_arr_manual_mode;
                    sync_restart_on_edge = g_arr_manual_mode ? 0u : 1u; /* В ручном ARR-режиме запрещаем жёсткий перезапуск по первому фронту */
                    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
                    vnd_sync_start_tim5_base();
                }

                /* ПРОАКТИВНО: очистим возможный "хвост" занятости IN EP с прошлой сессии */
                do {
                    extern void USBD_VND_ForceTxIdle(void);
                    USBD_VND_ForceTxIdle();
                    vnd_ep_busy = 0; vnd_tx_ready = 1; vnd_inflight = 0;
                    vnd_last_tx_start_ms = 0; /* чтобы WDG не сработал по старой метке */
                    /* Полностью очистим meta-FIFO для корректной классификации первой пары */
                    vnd_tx_meta_head = vnd_tx_meta_tail = 0;
                    meta_push_total = meta_pop_total = meta_empty_events = meta_overflow_events = 0;
                } while(0);
                streaming = 1;
                     /* ГАРАНТИЯ повторного старта:
                         после STOP/alt-reset хост ожидает «чистый» старт. Перезапускаем ADC/DMA и сбрасываем
                         внутренние rd/wr seq в adc_stream (иначе возможна деградация FPS на последующих запусках).
                         ВАЖНО: делаем это отложенно в main-loop (Vendor_Stream_Task), а не из USB RX. */
                     vnd_adc_restart_request = 1;
                /* Включаем async декуплинг по умолчанию в полном режиме.
                   В тестовом режиме принудительно держим async=0, чтобы использовать
                   парный пайплайн с синтетической пилой. */
#if USE_TEST_SAWTOOTH
                async_mode = 0;
                vnd_strict_pairing = 0;
                cdc_logf("START: TEST mode forces async=0 (pair pipeline)");
#else
                        /* LOSSLESS_ROI держим на парном FIFO-пути: DMA всегда 600, USB отдаёт ROI 200 без latest/snapshot. */
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI){
                            async_mode = 0;
                            vnd_strict_pairing = 0;
                } else if(!async_mode_host_set){
                    async_mode = 1;
                }
#endif
                dbg_last_forced_stat_ms = start_cmd_ms;
                vnd_tx_ready = 1; vnd_ep_busy = 0; vnd_inflight = 0;
                vnd_last_txcplt_ms = HAL_GetTick();
                /* Разрешим STAT только после первой завершённой пары */
                first_pair_done = 0; pending_status = 0; vnd_status_permit_once = 0;
                /* Инициализация FPS измерения */
                fps_measurement_start_ms = HAL_GetTick();
                fps_last_report_ms = fps_measurement_start_ms;
                fps_pair_count = 0;
                fps_frame_a_count = 0;
                fps_frame_b_count = 0;
                fps_prepare_count = 0;
                /* Инициализация профилирования */
                memset(&perf_stats, 0, sizeof(perf_stats));
                /* Индикация START */
                vnd_tx_bytes_at_start = vnd_total_tx_bytes;
                HAL_GPIO_WritePin(Data_ready_GPIO22_GPIO_Port, Data_ready_GPIO22_Pin, GPIO_PIN_SET);
                     /* ADC/DMA: для надёжного STOP→START делаем restart на каждый START (отложенно). */
                     VND_LOG("START_STREAM: transmission enabled (ADC restart pending)");
                /* ДИАГНОСТИКА: выводим активный профиль и параметры */
                {
                    uint8_t prof = adc_stream_get_profile();
                    uint16_t samp = adc_stream_get_active_samples();
                    uint16_t rate = adc_stream_get_buf_rate();
                    cdc_logf("EVT START t=%lu profile=%u samples=%u rate=%u Hz bytes=%llu", 
                             (unsigned long)start_cmd_ms, prof, samp, rate, (unsigned long long)vnd_tx_bytes_at_start);
                    
                    /* Обновляем дисплей с параметрами потока */
                    // stream_info_t stream_info = {
                    //     .frequency_hz = rate,
                    //     .start_sample = 0,
                    //     .sample_count = samp,
                    //     .frames_sent = 0,
                    //     .is_streaming = 1
                    // };
                    // stream_display_update(&stream_info);
                    /* Параметры хоста (профиль/окна/частоты) */
                    vnd_update_lcd_params();
                    cdc_logf("INIT_DBG ASYNC_EN=1 pending_init=%u seq=%lu", (unsigned)vnd_pending_init, (unsigned long)stream_seq);
                }
                if(!full_mode){ diag_mode_active = 1; }
                VND_LOG("START_STREAM");
                /* Не отправляем ACK-STAT через IN на старте — позволим сразу начать A/B. */
                /* Не формируем синтетическую первую пару: ждём реальные данные */
#if !VND_DISABLE_TEST
                if(!test_sent && !test_in_flight && !vnd_ep_busy){ vnd_try_send_test_from_task(); }
#endif
                /* Важно: не начинаем передачу до выполнения отложенного adc_stream_restart(). */
                cdc_logf("START: defer initial TX (adc_restart_request=%u)", (unsigned)vnd_adc_restart_request);
                vnd_tx_kick = 1;
                /* Диагностический режим: подготовка и первая отправка */
                if(diag_mode_active){
                    if(cur_samples_per_frame == 0){
                        /* если хост задал samples_per_frame — используем его для DIAG */
                        uint16_t ds = (vnd_frame_samples_req != 0) ? vnd_frame_samples_req : diag_samples;
                        if(ds > VND_MAX_SAMPLES) ds = VND_MAX_SAMPLES;
                        diag_samples = ds;
                        cur_samples_per_frame = diag_samples;
                        cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + cur_samples_per_frame*2u);
                    }
                    diag_prepared_seq = 0xFFFFFFFFu; diag_current_pair_seq = 0xFFFFFFFFu;
                    vnd_diag_prepare_pair(stream_seq, cur_samples_per_frame);
                    diag_prepared_seq = stream_seq; diag_current_pair_seq = stream_seq;
                    if(!vnd_ep_busy){ (void)vnd_diag_try_tx(); }
                }
                /* Передача стартует из Vendor_Stream_Task после ADC restart */
        }
        break;
        case VND_CMD_SET_FRAME_SAMPLES:
            if(len >= 3){
                uint16_t ns = (uint16_t)(data[1] | (data[2] << 8));
                if(ns > VND_MAX_SAMPLES) ns = VND_MAX_SAMPLES;
                vnd_frame_samples_req = ns; /* Использовать значение хоста напрямую */
                /* Применим к диагностике сразу, чтобы DIAG шёл с нужным размером */
                diag_samples = (ns != 0) ? ns : diag_samples;
                vnd_recompute_pair_timing(vnd_frame_samples_req);
                /* Снимем фиксацию размера, чтобы применилось при следующем build */
                cur_samples_per_frame = 0; cur_expected_frame_size = 0;
                VND_LOG("SET_FRAME_SAMPLES %u -> period=%ums", (unsigned)vnd_frame_samples_req, (unsigned)vnd_pair_period_ms);
                cdc_logf("EVT SET_FRAME_SAMPLES %u", (unsigned)vnd_frame_samples_req);
                vnd_update_lcd_params();
            }
            break;
        case VND_CMD_STOP_STREAM:
        {
            /* ДИАГНОСТИКА: фиксируем прием команды STOP, сбрасываем счётчик START */
            last_cmd_received = 0x21;
            last_cmd_timestamp_ms = HAL_GetTick();
            cmd_stop_count++;
            cmd_start_count = 0;  /* Сброс счётчика START по команде STOP */
            vnd_update_cmd_indicator();
            
            /* В полном режиме: STOP с ACK-STAT между парами; в DIAG — немедленная остановка без STAT по bulk */
            if(diag_mode_active){
                /* Мгновенно останавливаем стрим без ACK-STAT в bulk, чтобы не нарушать DIAG поток */
                stop_request = 0; pending_status = 0;
                if(streaming){ streaming = 0; VND_LOG("STOP_STREAM (diag, immediate)"); }
                diag_mode_active = 0;
                vnd_reset_buffers();
                sending_channel = 0xFF; pending_B = 0; pending_B_since_ms = 0; test_sent = 0; test_in_flight = 0; vnd_inflight = 0;
                /* КРИТИЧНО: полный сброс состояния для возможности повторного START */
                vnd_pending_init = 0;
                vnd_stream_active = 0;
                vnd_last_frame_txcplt_ms = 0;
                vnd_last_host_rx_ack_ms = 0;
                vnd_host_rx_last_counter = 0;
                vnd_host_rx_counter_valid = 0;
                vnd_ep_busy = 0;
                vnd_tx_ready = 1;
                /* ADC/DMA продолжают работать в фоне, STOP только выключает передачу по USB */
                HAL_GPIO_WritePin(Data_ready_GPIO22_GPIO_Port, Data_ready_GPIO22_Pin, GPIO_PIN_RESET);
                vnd_apply_tx_enable_outputs();
                {
                    uint64_t cur = vnd_total_tx_bytes;
                    uint64_t delta = (cur >= vnd_tx_bytes_at_start) ? (cur - vnd_tx_bytes_at_start) : 0ULL;
                    cdc_logf("EVT STOP total=%llu delta=%llu", (unsigned long long)cur, (unsigned long long)delta);
                    
