kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
                    /* Обновляем дисплей: поток остановлен */
                    // stream_info_t stream_info = {
                    //     .frequency_hz = 0,
                    //     .start_sample = 0,
                    //     .sample_count = 0,
                    //     .frames_sent = dbg_sent_ch0_total + dbg_sent_ch1_total,
                    //     .is_streaming = 0
                    // };
                    // stream_display_update(&stream_info);
                    vnd_update_lcd_params();
                }
                vnd_tx_kick = 1; /* пнуть таск на всякий случай */
            } else {
                /* STOP в полном режиме: мгновенная остановка, полный сброс ВСЕХ флагов */
                streaming = 0;  /* Главное: остановить передачу */
                VND_LOG("STOP_STREAM (full mode)");
                
                /* Сброс запросов на STAT — они больше не нужны */
                stop_request = 0;
                pending_status = 0;
                status_ack_pending = 0;
                stop_stat_inflight = 0;
                
                /* Сброс состояния передачи для разрешения следующего START */
                vnd_pending_init = 0;
                vnd_stream_active = 0;
                vnd_last_frame_txcplt_ms = 0;
                vnd_last_host_rx_ack_ms = 0;
                vnd_host_rx_last_counter = 0;
                vnd_host_rx_counter_valid = 0;
                vnd_ep_busy = 0;
                vnd_tx_ready = 1;
                vnd_inflight = 0;
                vnd_tx_kick = 0;  /* Сбросить флаг kick */
                vnd_async_state_reset_req = 1;
                inflight_is_frame = 0;
                inflight_flags = 0;
                inflight_seq = 0;

                /* STOP должен полностью освобождать IN endpoint и кадры, включая ROI B_SENDING. */
                do {
                    extern void USBD_VND_ForceTxIdle(void);
                    USBD_VND_ForceTxIdle();
                    vnd_tx_meta_head = vnd_tx_meta_tail = 0;
                    meta_push_total = meta_pop_total = meta_empty_events = meta_overflow_events = 0;
                    vnd_reset_buffers();
                } while(0);
                
                /* Сброс флагов пар и статусов */
                first_pair_done = 0;
                start_ack_done = 1;
                vnd_status_permit_once = 0;
                
                /* КРИТИЧНО: НЕ сбрасываем async_mode и full_mode - они устанавливаются START */
                /* async_mode должен остаться 1 после первого START */
                
                HAL_GPIO_WritePin(Data_ready_GPIO22_GPIO_Port, Data_ready_GPIO22_Pin, GPIO_PIN_RESET);
                vnd_apply_tx_enable_outputs();
                cdc_logf("EVT STOP t=%lu async=%d full=%d ep_busy=%d", 
                         (unsigned long)HAL_GetTick(), async_mode, full_mode, vnd_ep_busy);
            }
        }
        break;
        
        case VND_CMD_DEVICE_RESET:
        {
            VND_LOG("DEVICE_RESET commanded!");
#if VND_DEVICE_RESET_SOFT_ONLY
            /* Мягкий путь: просим main выполнить soft USB recovery без полного MCU reset */
            cdc_logf("[VND] soft USB recovery requested by 0x22 at t=%lu ms", (unsigned long)HAL_GetTick());
            need_recovery = 1;
#else
            /* Жёсткий путь: ставим флаг для main-loop (выполнит корректный disconnect+NVIC_SystemReset) */
            extern volatile uint8_t need_hard_reset;
            cdc_logf("!!! HARD_RESET scheduled by host 0x22 at t=%lu ms", (unsigned long)HAL_GetTick());
            need_hard_reset = 1;
#endif
        }
        break;
        
        case VND_CMD_GET_STATUS:
        {
            /* GET_STATUS всегда допускается: во время стрима — только между парами */
            /* Диагностическая вставка: классификация паузы при запросе статуса (редкая, чтобы не тормозить) */
            vnd_diag_log_possible_stall();

            /* Автокик: если во время стрима ничего не летит (EP свободен, нет inflight и пустая meta-очередь),
               попробуем мягко сдвинуть пайплайн. Это лечит зависания вида ADC_IDLE/A_READY_NOT_TX. */
            if(streaming && !vnd_ep_busy && !vnd_inflight && (vnd_tx_meta_depth() == 0))
            {
                int kicked = 0;
                if(async_mode){
                    kicked = vnd_async_try_tx();
                } else {
                    if(pending_B){ kicked = vnd_try_send_B_immediate(); }
                    if(!kicked){ kicked = vnd_try_send_A_nextpair_immediate(); }
                    if(!kicked){ vnd_prepare_pair(); kicked = vnd_try_send_A_nextpair_immediate(); }
                }
                if(kicked){ VND_LOG("KICK_TX by GET_STATUS"); }
            }

            if(streaming){
                /* В DIAG-режиме исключаем любые STAT в bulk-потоке: используйте EP0 (ctrl) */
                if(diag_mode_active){ VND_LOG("GET_STATUS bulk ignored in DIAG (use EP0)"); break; }
                pending_status = 1; VND_LOG("GET_STATUS queued"); break;
            }
            if(!vnd_ep_busy)
            {
                vnd_status_permit_once = 1;
                uint16_t l = vnd_build_status((uint8_t*)status_buf, sizeof(status_buf));
                if(l)
                {
                    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = l; vnd_last_tx_start_ms = HAL_GetTick();
                    vnd_mark_service_inflight();
                    if(USBD_VND_Transmit(&hUsbDeviceHS, (uint8_t*)status_buf, l) == USBD_OK){
                        vnd_tx_meta_after((uint8_t*)status_buf, l);
                        VND_LOG("STAT_TX req len=%u", l);
                    } else {
                        VND_LOG("STAT_BUSY_FAIL");
                        vnd_status_permit_once = 0;
                        vnd_rollback_tx_start();
                    }
                }
            } else {
                pending_status = 1; VND_LOG("STAT_PENDING on GET_STATUS");
            }
        }
        break;

        case VND_CMD_HOST_RX_ACK:
        {
            if (len >= 5u) {
                uint32_t host_frames = (uint32_t)data[1] |
                                       ((uint32_t)data[2] << 8) |
                                       ((uint32_t)data[3] << 16) |
                                       ((uint32_t)data[4] << 24);
                if ((!vnd_host_rx_counter_valid) || (host_frames != vnd_host_rx_last_counter)) {
                    vnd_last_host_rx_ack_ms = HAL_GetTick();
                }
                vnd_host_rx_last_counter = host_frames;
                vnd_host_rx_counter_valid = 1u;
            }
        }
        break;

        case VND_CMD_HOST_RX_CLEAR:
        {
            vnd_last_host_rx_ack_ms = 0;
            vnd_host_rx_last_counter = 0;
            vnd_host_rx_counter_valid = 0;
        }
        break;

