kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
uint32_t vnd_get_last_host_rx_ack_ms(void)
{
    return vnd_last_host_rx_ack_ms;
}

uint32_t vnd_get_last_error(void)
{
    return vnd_last_error;
}

/* Общее число переданных байт (все передачи) */
uint64_t vnd_get_total_tx_bytes(void)
{
    return vnd_total_tx_bytes;
}

/* Общее число переданных сэмплов (оба канала суммарно) */
uint64_t vnd_get_total_tx_samples(void)
{
    return vnd_total_tx_samples;
}

void vnd_log_usb_close_snapshot(const char *reason)
{
    uint32_t now_ms = HAL_GetTick();
    extern uint8_t USBD_VND_TxIsBusy(void);
    extern uint16_t USBD_VND_InTotalLength(void);
    extern uint32_t USBD_VND_DataInCount(void);
    extern volatile uint32_t main_loop_heartbeat;
    extern volatile uint32_t last_heartbeat_ms;
    extern volatile uint32_t loop_cycle_last_avg;
    extern volatile uint32_t g_usb_last_sof_ms;

    uint32_t last_age = 0xFFFFFFFFu;
    uint32_t frame_age = 0xFFFFFFFFu;
    uint32_t tx_age = 0xFFFFFFFFu;
    uint32_t host_rx_age = 0xFFFFFFFFu;
    uint32_t hb_age = 0xFFFFFFFFu;
    uint32_t sof_age = 0xFFFFFFFFu;
    uint32_t force_idle_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, vnd_last_txcplt_ms, &last_age);
    (void)vnd_tick_age_ms(now_ms, vnd_last_frame_txcplt_ms, &frame_age);
    (void)vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &tx_age);
    (void)vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &host_rx_age);
    (void)vnd_tick_age_ms(now_ms, last_heartbeat_ms, &hb_age);
    (void)vnd_tick_age_ms(now_ms, g_usb_last_sof_ms, &sof_age);
    (void)vnd_tick_age_ms(now_ms, dbg_tx_force_idle_last_ms, &force_idle_age);

    adc_stream_debug_t dbg;
    adc_stream_get_debug(&dbg);
    const char *stA = (g_frames[0][0].st==FB_READY?"READY":(g_frames[0][0].st==FB_SENDING?"SENDING":"FILL"));
    const char *stB = (g_frames[0][1].st==FB_READY?"READY":(g_frames[0][1].st==FB_SENDING?"SENDING":"FILL"));

    printf("[USB_CLOSE_SNAPSHOT] reason=%s t=%lu stream=%u active=%u mode=%u async=%u ch=%u ep=%u ll=%u infl=%u pendB=%u sendch=%u meta=%u q=%u err=%lu kick=%u last=%lu frame=%lu txage=%lu len=%u tl=%u din=%lu rxage=%lu rx=%lu txcplt=%lu A=%lu B=%lu wr=%lu rd=%lu avg=%lu/%lu/%lu force=%lu/%lu drop=%lu/%lu hb=%lu hbage=%lu sof=%lu loop=%lu dma=%lu/%lu A_st=%s B_st=%s\r\n",
           reason ? reason : "?",
           (unsigned long)now_ms,
           (unsigned)streaming,
           (unsigned)vnd_stream_active,
           (unsigned)vnd_stream_mode,
           (unsigned)async_mode,
           (unsigned)vnd_ch_mode,
           (unsigned)vnd_ep_busy,
           (unsigned)USBD_VND_TxIsBusy(),
           (unsigned)vnd_inflight,
           (unsigned)pending_B,
           (unsigned)sending_channel,
           (unsigned)vnd_tx_meta_depth(),
           (unsigned)vnd_avg_q_count,
           (unsigned long)vnd_last_error,
           (unsigned)vnd_tx_kick,
           (unsigned long)last_age,
           (unsigned long)frame_age,
           (unsigned long)tx_age,
           (unsigned)vnd_last_tx_len,
           (unsigned)USBD_VND_InTotalLength(),
           (unsigned long)USBD_VND_DataInCount(),
           (unsigned long)host_rx_age,
           (unsigned long)vnd_host_rx_last_counter,
           (unsigned long)dbg_tx_cplt,
           (unsigned long)dbg_sent_ch0_total,
           (unsigned long)dbg_sent_ch1_total,
           (unsigned long)frame_wr_seq,
           (unsigned long)frame_rd_seq,
           (unsigned long)dbg_avg_in_frames,
           (unsigned long)dbg_avg_out_frames,
           (unsigned long)dbg_avg_tx_pairs,
           (unsigned long)dbg_tx_force_idle_count,
           (unsigned long)force_idle_age,
           (unsigned long)dbg_tx_drop_recovery_count,
           (unsigned long)dbg_tx_drop_recovery_request_count,
           (unsigned long)main_loop_heartbeat,
           (unsigned long)hb_age,
           (unsigned long)sof_age,
           (unsigned long)loop_cycle_last_avg,
           (unsigned long)dbg.dma_full0,
           (unsigned long)dbg.dma_full1,
           stA,
           stB);
}

/* Общая диагностическая функция: при обращении хоста за статусом проверяет признаки паузы
   и печатает STALL_WARN не чаще чем раз в 2 секунды. Вызывается как из bulk-пути, так и из EP0. */
/* Беззнаковая разность тиков (обработка переполнения 32-бит HAL_GetTick()). */
static inline uint32_t tick_diff32(uint32_t now, uint32_t before){
    return (now >= before) ? (now - before) : (0xFFFFFFFFu - before + 1u + now);
}

void vnd_diag_log_possible_stall(void)
{
    static uint32_t last_stall_warn_ms = 0;
    if(!streaming) return;
    uint32_t now_ms = HAL_GetTick();
    uint32_t dt = tick_diff32(now_ms, vnd_last_txcplt_ms);
    if(dt <= 600 || dt >= 3000) return;
    if(last_stall_warn_ms != 0 && (now_ms - last_stall_warn_ms) <= 2000) return;
    extern uint8_t USBD_VND_TxIsBusy(void);
    uint8_t ll_busy = USBD_VND_TxIsBusy();
    const char *stA = (g_frames[0][0].st==FB_READY?"READY":(g_frames[0][0].st==FB_SENDING?"SENDING":"FILL"));
    const char *stB = (g_frames[0][1].st==FB_READY?"READY":(g_frames[0][1].st==FB_SENDING?"SENDING":"FILL"));
    adc_stream_debug_t dbg; adc_stream_get_debug(&dbg);
    const char *stall_class = "UNKNOWN";
    uint8_t have_meta = (vnd_tx_meta_depth() > 0);
    uint32_t wr = frame_wr_seq, rd = frame_rd_seq;
    if(!have_meta && !pending_B && !ll_busy && !vnd_ep_busy){
        stall_class = "ADC_IDLE";
    } else if((vnd_ep_busy || ll_busy) && vnd_inflight){
        stall_class = "USB_BUSY";
    } else if(pending_B){
        if(g_frames[0][1].st!=FB_READY && g_frames[0][1].st!=FB_SENDING){ stall_class = "WAIT_B_FILL"; }
        else if(g_frames[0][1].st==FB_READY && !vnd_ep_busy){ stall_class = "B_READY_NOT_TX"; }
        else if(g_frames[0][1].st==FB_SENDING){
            uint32_t b_age_ms = 0u;
            if(vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &b_age_ms) && b_age_ms > 120u){
                stall_class = "B_INFLIGHT_LONG";
            } else {
                stall_class = "PEND_B";
            }
        }
        else stall_class = "PEND_B";
    } else if(!pending_B && g_frames[0][0].st==FB_READY && !vnd_ep_busy){
        stall_class = "A_READY_NOT_TX";
    } else if(have_meta && !vnd_inflight && !vnd_ep_busy){
        stall_class = "META_WAIT";
    }
    static uint32_t last_wr_seq = 0; static uint32_t last_wr_ms = 0;
    if(wr != last_wr_seq){ last_wr_seq = wr; last_wr_ms = now_ms; }
    else if(tick_diff32(now_ms, last_wr_ms) > 300 && strcmp(stall_class,"ADC_IDLE")!=0){ stall_class = "ADC_STALL"; }
    cdc_logf("STALL_WARN class=%s dt=%lums ep_busy=%u ll_busy=%u inflight=%u pendB=%u ch=%u A=%s B=%s metaD=%u wr=%lu rd=%lu prod=%lu sentA=%lu sentB=%lu dmaF0=%lu dmaF1=%lu",
        stall_class,
        (unsigned long)dt,
        (unsigned)vnd_ep_busy,
        (unsigned)ll_busy,
        (unsigned)vnd_inflight,
        (unsigned)pending_B,
        (unsigned)sending_channel,
        stA, stB,
        (unsigned)vnd_tx_meta_depth(),
        (unsigned long)wr,
        (unsigned long)rd,
        (unsigned long)dbg_produced_seq,
        (unsigned long)dbg_sent_ch0_total,
        (unsigned long)dbg_sent_ch1_total,
        (unsigned long)dbg.dma_full0,
        (unsigned long)dbg.dma_full1);
    VND_LOG("STALL_WARN class=%s dt=%lums ep_busy=%u ll_busy=%u pendB=%u A=%s B=%s metaD=%u wr=%lu rd=%lu",
        stall_class,
        (unsigned long)dt,
        (unsigned)vnd_ep_busy,
        (unsigned)ll_busy,
        (unsigned)pending_B,
        stA, stB,
        (unsigned)vnd_tx_meta_depth(),
        (unsigned long)wr,
        (unsigned long)rd);
    last_stall_warn_ms = now_ms;
}

/* Хук от цепочки ADC: когда появились новые кадры — пинаем таск */
void adc_stream_on_new_frames(uint32_t frames_added)
{
    (void)frames_added;
    /* минимальный kick: если не заняты и идёт стрим — дать шанс таску отправить */
    if(streaming){ vnd_tx_kick = 1; }
}

/* Получить текущие min/max АЦП значения из последних отправленных кадров */
void vnd_get_adc_minmax(int16_t *adc0_min, int16_t *adc0_max, 
                        int16_t *adc1_min, int16_t *adc1_max)
{
    static int16_t cached_adc0_min = 0;
    static int16_t cached_adc0_max = 0;
    static int16_t cached_adc1_min = 0;
    static int16_t cached_adc1_max = 0;
    static uint32_t cached_seq = 0;
    static uint32_t log_count = 0;
    
