kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    if(!adc0_min || !adc0_max || !adc1_min || !adc1_max) {
        return;
    }
    
    /* Пытаемся найти последний готовый кадр для получения min/max */
    uint8_t idx = (pair_send_idx > 0) ? (pair_send_idx - 1) : (VND_PAIR_BUFFERS - 1);
    
    /* Логируем состояние буферов каждые 50 вызовов */
    if(log_count++ % 50 == 0) {
        printf("[VND_GET_MINMAX] idx=%u seq_cached=%lu seq_current=%lu st=%u samples0=%u samples1=%u\r\n",
               idx, cached_seq, g_frames[idx][0].seq, g_frames[idx][0].st,
               g_frames[idx][0].samples, g_frames[idx][1].samples);
    }
    
    /* Проверяем, был ли кадр уже обработан */
    if(g_frames[idx][0].seq != cached_seq && g_frames[idx][0].st != FB_FILL) {
        cached_seq = g_frames[idx][0].seq;
        printf("[VND_GET_MINMAX] Processing frame seq=%lu\r\n", cached_seq);
        
        /* Декодируем min/max из кадра ADC0 */
        const uint8_t *buf = g_frames[idx][0].buf;
        uint16_t samples = g_frames[idx][0].samples;
        
        if(samples > 0 && g_frames[idx][0].frame_size >= 32 + 2*samples) {
            const int16_t *data = (const int16_t *)(buf + 32);
            cached_adc0_min = data[0];
            cached_adc0_max = data[0];
            
            for(uint16_t i = 1; i < samples; i++) {
                if(data[i] < cached_adc0_min) cached_adc0_min = data[i];
                if(data[i] > cached_adc0_max) cached_adc0_max = data[i];
            }
        }
        
        /* Декодируем min/max из кадра ADC1 */
        buf = g_frames[idx][1].buf;
        samples = g_frames[idx][1].samples;
        
        if(samples > 0 && g_frames[idx][1].frame_size >= 32 + 2*samples) {
            const int16_t *data = (const int16_t *)(buf + 32);
            cached_adc1_min = data[0];
            cached_adc1_max = data[0];
            
            for(uint16_t i = 1; i < samples; i++) {
                if(data[i] < cached_adc1_min) cached_adc1_min = data[i];
                if(data[i] > cached_adc1_max) cached_adc1_max = data[i];
            }
        }
        
        printf("[VND_GET_MINMAX] Decoded: CH0=%d..%d CH1=%d..%d\r\n",
               cached_adc0_min, cached_adc0_max, cached_adc1_min, cached_adc1_max);
    }
    
    *adc0_min = cached_adc0_min;
    *adc0_max = cached_adc0_max;
    *adc1_min = cached_adc1_min;
    *adc1_max = cached_adc1_max;
}

/* EOF (clean version) */
